<template>
  <div>
    <div class="card" style="line-height: 30px">
      <div>今天是椰汁糕冬瓜强生日，祝他生日快乐！</div>
    </div>

    <div class="card" style="line-height: 30px; margin-top:8px ;"> 
      <p>你好，各位白字。 <br>  
    这是一个收集厕所弹幕的网站: <span style="font-size: 24px; font-weight: bold; color: red;">DGQ63136.icu</span> <br>  
    请记住我！I see you~ <br>网站制作: <b>强哥咱跟她干吧</b></p>
    </div>

    <div class="card" style="line-height: 50px ;margin-top: 8px;">
      <div>
        <!-- <div class="button-table-container"><el-tag type="success">点击下面按钮随机弹幕</el-tag></div> -->
        <el-button type="primary" @click="getRandomItem" >点我随机一条弹幕</el-button>
        <el-table v-if="randomlySelectedItem" :data="[randomlySelectedItem]" style="font-family: 微软雅黑;font-size: 20px;">
          <el-table-column prop="barage" label="弹幕" ></el-table-column>
          <el-table-column label="" align="center" width="160">
            <template #default="scope">
              <el-button type="primary" @click="copyText(scope.row.barage)">复制</el-button>
            </template>
          </el-table-column>
        </el-table>
        <div v-else>
          <p>未选择随机项</p>
        </div>
      </div>
    </div>

    <div class="card" style="line-height: 50px ;margin-top: 10px ;margin-bottom: 10px; min-height: 120px;">
      <div style="font-size: 80px;">
              
        <el-input v-model="searchQuery" placeholder="搜索弹幕..." style="font-size: 25px; margin-top: 28px;">
          <template slot="append">
            <el-button icon="el-icon-search"></el-button>
          </template>
        </el-input>
        <el-table v-if="searchQuery" :data="filteredItems" stripe>
          <el-table-column prop="barage" label="弹幕" display:none></el-table-column>
          <el-table-column label="" align="center" width="160">
            <template #default="scope">
              <el-button type="primary" @click="copyText(scope.row.barage)">复制</el-button>
            </template>
          </el-table-column>
        </el-table>

      </div>
    </div>

    <div class="card" style="line-height: 100px ;margin-top: 8px; text-align: center;">
      <a href="https://www.wjx.cn/vm/P9UjaRI.aspx# " target="_blank" style="font-size: 25px;">我有更好的弹幕！点击投稿！！</a>
    </div>

  </div>
</template>

<script>

export default {
  data() {
    return {
      searchQuery: '',
      items: [
        {id: 1, barage: '2024年1月10日23点29分  冬瓜强警长一刀带走五个好人 警钟长鸣  '},
        {id: 2, barage: '！闹胡是就直简起一我带不，吧了思意够不太也这，瓜冬啊Z我：UQUQ丶鸟反  '},
        {id: 3, barage: '@JaLEn半仙：瓜强，我这里有锁匠任务  '},
        {id: 4, barage: '@Xleft小叮当:你是怎么做到看起来很忙。一点用没有的？  '},
        {id: 5, barage: '@XTSZzZzz：这个游戏，不只有狼，还有很多🐷  '},
        {id: 6, barage: '@阿乐fps：造李蛙！造李蛙！造李蛙！造李蛙！造李蛙！造李蛙！造李蛙！造李蛙！  '},
        {id: 7, barage: '@冬瓜强的正宫娘娘阿胖:每晚都说弄死我,没过两分钟都把自己弄成死鱼  '},
        {id: 8, barage: '@冬瓜强的正宫娘娘啊胖：如果你再不戒烟，那个B橡胶圈你就带一辈子！  '},
        {id: 9, barage: '@冬瓜强的正宫娘娘啊胖:我在“世界养猪大赛”中养出了猪王“椰汁糕冬瓜强”，点击+1  '},
        {id: 10, barage: '@精神永富:这些片总只是第一波嗷瓜强，别觉得踢了我能好过。  '},
        {id: 11, barage: '@狂鸟丶QUQU：我Z啊冬瓜，这关你都不会啊？一个单向烟一个提溜闪不就过去了？  '},
        {id: 12, barage: '@馒头:冬瓜强你大主播，你了不起，你清高，你就打压我吧，我就是要一步一步一步一步爬到最高  '},
        {id: 13, barage: '@娆春乔:冬瓜，去！给我叼回来！🦴🦴🦴🦴🦴  '},
        {id: 14, barage: '@日鸟丶QUQU：私はZああ、とても面白い、冬瓜は私を連れて遊びに行かないでまるででたらめだ  '},
        {id: 15, barage: '@偷鸟、ququ:我Z 啊，冬瓜，我都没偷你东西，干嘛打我，给你个Z，真是胡~~闹！  '},
        {id: 16, barage: '@灣鳥丶QUQU：靠北啦，掛牆！醬紫好玩的遊戲不叫我是要怎樣吼！簡直就是胡！鬧！  '},
        {id: 17, barage: '@吴尚泽123：强弟，我是不是给你脸了，明天就叫我爸爸打压你  '},
        {id: 18, barage: '@吴尚泽123:强叔，你真fw  '},
        {id: 19, barage: '@杨一歌 ： 游戏看不懂，帅脸看不到，就知道抽抽抽，死了得了人夫哥  '},
        {id: 20, barage: '@钻粉十级牌进群私信我：冬瓜强我是不是给你脸了？再骂一句试试？  '},
        {id: 21, barage: '“虽然彩字踩在了我的头上，但反过来我也用舌头弄脏了他的鞋底”———白字  '},
        {id: 22, barage: '“再见了👋，水友们😎”冬瓜强潇洒地拨动马桶上的按钮，旋转着被冲走了。  '},
        {id: 23, barage: '“猪手一双，蹄子两双，胡言乱语，脑子煲汤，全身上下，猪头最香，赢了纯躺，输了还装  '},
        {id: 24, barage: '《藏头诗》冬瓜强一坨史，瓜强一坨史，强一坨史，一坨史，坨史，史  '},
        {id: 25, barage: '《后室更新了》《明天就后室》《等刘迪结束就后室》《再刷后室杀了》  '},
        {id: 26, barage: '《刘迪更新了》《明天就刘迪》《等刘迪结束就刘迪》《再刷刘迪杀了》  '},
        {id: 27, barage: '《明天后室》是由冬瓜强指导，为游戏《后室》设计的DLC，将于明天上线。  '},
        {id: 28, barage: '《是的，直升机》《对的，肘击》《牛的，牢大》《卧槽里的，黄色冰红茶》  '},
        {id: 29, barage: '《我要戒烟了》《直接扔了》《戒两天》《忘了 把两口》《闻闻味道》《不管了死了得了》  '},
        {id: 30, barage: '《邀功声明》主播本次精彩高效行动纯属听取本人指挥。主播只是代为执行。所有荣耀归本人所有。  '},
        {id: 31, barage: '《以后俩小时把一根，兄弟们帮我监督》《我说戒烟，就肯定会戒了》《我再抽我就是丧狗》  '},
        {id: 32, barage: '꧁✨❤瑞斌瑞斌，直击我心❤✨꧂꧁✨❤瑞斌瑞斌，直击我心❤✨꧂꧁✨❤瑞斌瑞斌，直击我心❤✨꧂  '},
        {id: 33, barage: '꧁✨❤枝高枝高，冲上云霄❤✨꧂꧁✨❤枝高枝高，冲上云霄❤✨꧂꧁✨❤枝高枝高，冲上云霄❤✨꧂  '},
        {id: 34, barage: '+1可以，但是请你们+1的时候标注+1的是谁的弹幕，请尊重弹幕著作  '},
        {id: 35, barage: '✋停✋止✋这✋场✋闹✋剧✋吧✋✋停✋止✋这✋场✋闹✋剧✋吧✋  '},
        {id: 36, barage: '⚡😎享受⚡😎⚡😎享受⚡😎⚡😎享受⚡😎⚡😎享受⚡😎⚡😎享受⚡😎  '},
        {id: 37, barage: '0.17ratingの伝説,5eplの赤い悪魔!執睪葉一郎とは!  '},
        {id: 38, barage: '①白字说话要加敬语，特别是对彩字②白字每条弹幕限制在3个字以内③彩字和彩字对话时白字不能插嘴  '},
        {id: 39, barage: '2022年11月16日晚20:40分冬瓜强5EPL0.17rating  '},
        {id: 40, barage: '2023.11.28晚十一点二十分，冬瓜强引爆地雷炸死京爷阿乐自己共三人，警钟长鸣！  '},
        {id: 41, barage: '2023年10月23日04:07分，冬瓜强自爆爆皮过长，警钟长鸣  '},
        {id: 42, barage: '2023年11月15日01:39:35 冬瓜 刘頔 超哥 被小夹子美人计一石三杀，警钟长鸣  '},
        {id: 43, barage: '2023年12月22日1:59，冬瓜强搂喜欢算，差3块葬送8千存款，警钟长鸣！  '},
        {id: 44, barage: '2023年12月26日22点53分35秒，冬瓜强身为连环杀手一刀没出反而进入狼坑，警钟长鸣！  '},
        {id: 45, barage: '2023年12月29日22:08冬瓜强加拿大鹅在14个人中报身份给刺客XF，警钟长鸣  '},
        {id: 46, barage: '2023年12月29日22:59，老叶发出感叹：这么蠢的刺客吗？（冬瓜强-刺客-饮弹自尽）  '},
        {id: 47, barage: '2023年1月11号2点46分阿胖锐评冬瓜强是软香蕉🍌警钟长鸣  '},
        {id: 48, barage: '2023年1月4日0点16分27秒，苏迪、刘頓、冬瓜决赛圈三打一荣获第二名，警钟长鸣！  '},
        {id: 49, barage: '2023年2月17号17点45分 阿胖锐评冬瓜强因为阿胖不陪他打针半夜一两点掉小珍珠  '},
        {id: 50, barage: '2023年3月18日2点29分 冬瓜 茄子 lisa jee 决赛圈四打一被反杀，警钟长鸣  '},
        {id: 51, barage: '2023年3月23日23点26分刘頔《尿我身上吧》 警钟长鸣！  '},
        {id: 52, barage: '2023年5月7日19:51分HHJ选用貂蝉获得2.5分！警钟长鸣  '},
        {id: 53, barage: '2023年6月29日2:28 冬瓜超哥刘頔钙奶马飞 瓦0：13 警钟长鸣  '},
        {id: 54, barage: '2023年9月17日00:04:17 批高户外看女主播流哈喇子，并表示独占63136  '},
        {id: 55, barage: 'C63的声浪盖过了兄弟们的呼声 也掩盖了你的初心  '},
        {id: 56, barage: 'Newhappy明明：强哥战地还玩吗？不玩我退款了，买了一次都不叫我玩  '},
        {id: 57, barage: 'α这是阿尔法，β这是贝塔，γ这是伽玛，δ这是德尔塔，ε这是我亲瓜瓜的小嘴巴  '},
        {id: 58, barage: '🍚🥢🐷哼哧哼哧🍚🥢🐷哼哧哼哧🍚🥢🐷哼哧哼哧🍚🥢🐷哼哧哼哧  '},
        {id: 59, barage: '🐱🎈：冬瓜别玩了,我在后室里等你了。  '},
        {id: 60, barage: '🐱真的要娶馨儿么  '},
        {id: 61, barage: '👊🏿男人 哈哈哈，🎤什么可以我说？🚁曼巴 👉🏿出去！  '},
        {id: 62, barage: '👍😀天才👍😀天才👍👍😀天才👍😀天才👍👍😀天才👍😀天才👍  '},
        {id: 63, barage: '💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃  '},
        {id: 64, barage: '💖꧁麒芳麒芳，举世无双꧂💖💖꧁麒芳麒芳，举世无双꧂💖💖꧁麒芳麒芳，举世无双꧂  '},
        {id: 65, barage: '🤖机器人测试弹幕，请机器人🤖自行+1，+1的都是机器人🤖  '},
        {id: 66, barage: '🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬  '},
        {id: 67, barage: '🧡甜💛瓜💚西💙瓜💜哈🧡蜜💜瓜💚不💛爱🧡冬💛瓜❤️是💗傻🤎瓜  '},
        {id: 68, barage: '🧡甜💛瓜💚西💙瓜💜哈🧡蜜💜瓜💚不💛爱🧡冬💛瓜❤️是💗傻🤎瓜  '},
        {id: 69, barage: '🧹清理白字🧹清理白字🧹清理白字🧹清理白字🧹清理白字🧹清理白字  '},
        {id: 70, barage: '阿胖越胖，吃的越多，吃的越多，胃里空间越少，空间越少，吃的越少，阿胖越瘦，所以阿胖越胖，阿胖越瘦  '},
        {id: 71, barage: '爱你嘴巴嘟嘟😘爱你睡觉呼呼😴爱你撒娇哭哭😭爱你冬瓜猪猪😍  '},
        {id: 72, barage: '蔡徐坤❤陈立农❤范丞丞❤黄明昊❤林彦俊❤朱正廷❤王子异❤王琳凯❤尤长靖❤️冬瓜强  '},
        {id: 73, barage: '超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭  '},
        {id: 74, barage: '抽的越多,肺癌越早.肺癌越早,活的越少.活的越少,抽的越少.所以抽的越多抽的越少  '},
        {id: 75, barage: '此弹幕用于统计原神玩家，请原神玩家看到此弹幕后+1  '},
        {id: 76, barage: '大主播了，漂亮老婆娶了，大豪宅住上了，C63开上了，嫌兄弟们烦了  '},
        {id: 77, barage: '冬瓜别气，喝奶奶🍼🍼🍼🍼🍼冬瓜别气，喝奶奶🍼🍼🍼🍼🍼  '},
        {id: 78, barage: '冬瓜哥，我只是玩玩梗而已，我真不是女大学生，别私信发我那些图片了，还有，你那个挺可爱的  '},
        {id: 79, barage: '端午节女大学生在纠结吃甜粽还是咸粽，冬瓜说：吃我吧，我可甜可咸，是个杂粽！  '},
        {id: 80, barage: '诶 你身上有炸弹哦！———Wegame世一吉格斯 绿色贝雷蛙 一键天赋已配备  '},
        {id: 81, barage: '刚来，谁窥？谁针对？谁在 捂眼喊撤退？谁混？谁内鬼？谁的玩法不团队？谁又没有人情味？  '},
        {id: 82, barage: '哥谭市里你最狂🤡，马戏团里你最忙🤡，麦当劳前你站岗🤡，扑克牌里大小王🤡，斗鱼公厕冬瓜强🤡  '},
        {id: 83, barage: '给点吧😭🤲给点吧😭🤲给点吧😭🤲给点吧😭🤲给点吧😭🤲  '},
        {id: 84, barage: '给主播拍照📷：🐷（正面特写）🐖（侧面特写）🐽（局部放大）🥩（过年限定）  '},
        {id: 85, barage: '瓜强你声音小点我男朋友睡着了把他喊醒了他又要弄我  '},
        {id: 86, barage: '怪不得你有自信开摄像头 你这样的猪🐷到双汇和金锣哪不是顶级食材啊  '},
        {id: 87, barage: '官鸟丶ququ：坚决落实一天一玩，一户一玩，应玩尽玩。让老百姓喜欢玩，爱上玩，怕不玩  '},
        {id: 88, barage: '好🥬，看得好爽😋！好🥬，看得好爽🥳！好🥬，看得好爽😋！好🥬，看得好爽🥳  '},
        {id: 89, barage: '好无聊，牵着我的电子宠物散散步————🤡▜▜▙（冬瓜强）（可以摸）（已嘎蛋）  '},
        {id: 90, barage: '很难想象同样是尤物，猫就蠢的很幽默，冬瓜就蠢的很想骂，这是为什么呢？  '},
        {id: 91, barage: '很喜欢老白的一句话 冬瓜强的残局过程很精彩 结局却往往不尽人意  '},
        {id: 92, barage: '红色是危险，蓝色是冷漠，绿色是伪装，紫色是神秘，橙色是愤怒，黑色是归宿,黄色发给我  '},
        {id: 93, barage: '呼，瓜酱の笑颜、就算是我这样「卑·微」の肥宅，也想要一直守护！欺负瓜酱的事情、是绝对——达咩哟！  '},
        {id: 94, barage: '急死了都🥵急死了都🥵急死了都🥵急死了都🥵急死了都🥵急死了都🥵急死了都🥵  '},
        {id: 95, barage: '加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！  '},
        {id: 96, barage: '家人们，家人们，9敏🆘🆘，我真的会谢❗❗❗大无语事件发生，咱就是说最近在小红薯发现  '},
        {id: 97, barage: '叫兄弟太亲密，叫主播太生疏，叫homie太崇洋，叫宝贝太油腻，晚上好儿子  '},
        {id: 98, barage: '桀鸟丶ququ：我嬲咧，这么好的包点不埋我的金河田，简直就是瞎！装！机！  '},
        {id: 99, barage: '今天登了女儿斗鱼🌹看看女儿平时刷些什么🌹是你我就放心了🌹男人就该像你这样🌹  '},
        {id: 100, barage: '京鸟丶QUQU：八套！北京我有八套房子！你敢跟我作对？我买你命啊！  '},
        {id: 101, barage: '绝食鹈鹕，永生加拿大，无爪猎鹰，炸膛刺客，小脑警长，那你无敌了呀🤡  '},
        {id: 102, barage: '开开开😡→乱踩人🤪→发言结巴😰→被投出局😭→沉默😑→开开开😡  '},
        {id: 103, barage: '看到满屏幕的弹幕都在阴阳瓜瓜，心里不是滋味，只有我知道瓜瓜的努力，加油没用的东西！  '},
        {id: 104, barage: '扣1复活钙奶扣1复活钙奶扣1复活钙奶扣1复活钙奶扣1复活钙奶  '},
        {id: 105, barage: '狂鸟丶ququ：我z啊冬瓜，这么好的比赛居然不叫我看，简直就是胡闹  '},
        {id: 106, barage: '老哥们，我多嘴问一句，我可以多嘴问一句吗，如果可以，那我多嘴问一句，我多嘴吗？  '},
        {id: 107, barage: '老子真想把设计这个加一过快，请稍后再试的b一刀杀了！  '},
        {id: 108, barage: '骂冬瓜可能会被禁言 但是不骂冬瓜等于一直被禁言  '},
        {id: 109, barage: '馒鸟丶QUQU：（喘）这么好玩的游戏不叫我，你们玩，我歇了，真没生气，哎哟（喘）  '},
        {id: 110, barage: '馒头平时打得多好，发多少枪，多么奉献。只要在冬瓜眼里失误一次，那就要被说一晚上  '},
        {id: 111, barage: '没！有！红！烧！贝！雷！蛙！我！就！要！闹！  '},
        {id: 112, barage: '没！有！京！✌🏻！我！就！要！闹！  '},
        {id: 113, barage: '没有人一出生就是彩字，出生都是白字  '},
        {id: 114, barage: '米娜玩个大富翁混一混都有四千贵宾，隔壁冬瓜强奶都要摇掉了才五千贵宾  '},
        {id: 115, barage: '明天我中忍考试了，你可以跟我签订通灵契约做我的忍犬吗  '},
        {id: 116, barage: '那你无敌了呀?那你这运气谁能跟你比啊?那你太强了啊?那谁玩得过你啊  '},
        {id: 117, barage: '那你无敌了呀🤡那你这运气谁能跟你比啊🤡那你太强了啊🤡那谁玩得过你啊  '},
        {id: 118, barage: '你❤️✨唱💗✨的💚✨什💖✨么💜✨J💞✨B💛玩❤️✨意❤️  '},
        {id: 119, barage: '你到底在自卑什么，像你这种品种的狗，在哪个宠物市场不是被抢购一空？  '},
        {id: 120, barage: '你可以不攻击主播，但是等主播破防无差别攻击的时候，你别在这委屈😣  '},
        {id: 121, barage: '你们男生是不是都好色啊？我在学校都不敢看你们，怕你们在心里把我那个了  '},
        {id: 122, barage: '你们在这里喷主播，就好比往菜地里泼屎，主播非但不生气只会疯狂汲取营养  '},
        {id: 123, barage: '你们这帮傻波一弹幕电死你们⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟  '},
        {id: 124, barage: '你要怪我偷你外卖，那我还要问你为什么要点外卖呢，点了外卖还想吃外卖？好事怎么都让你占了  '},
        {id: 125, barage: '尿越多，肾越差，肾越差，尿越频，尿越频，尿越少，所以，尿越多，尿越少  '},
        {id: 126, barage: '您的账号在另一地点登录，弹幕连接已断开 点击重新连接弹幕  '},
        {id: 127, barage: '麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳  '},
        {id: 128, barage: '穷玩车富玩表，没钱我就玩玩鸟，对着瓜瓜岛一岛，舒服一秒是一秒  '},
        {id: 129, barage: '人越多，+1越多，+1越多，人越烦，人越烦，人越少，所以，人越多，人越少  '},
        {id: 130, barage: '上一天班烦死了！😡还好有你叶志高我****！  '},
        {id: 131, barage: '實況主可以喘小聲些嗎,林北的咕咕bird都快爆掉了,沒在誇張的  '},
        {id: 132, barage: '市卫生所通知：叶志高先生，您于10月2日上午进行的公益行为“捐精”检测结果为：不合格  '},
        {id: 133, barage: '虽然主播的外观、智力水平、生活习性等与猪高度类似，但仍不能排除主播是人类的可能性  '},
        {id: 134, barage: '塔斯汀余姚店：叶枝高，你TM点不点，每次我快关门你给我来一单，我***  '},
        {id: 135, barage: '塔斯汀余姚万达店：你要点就现在点，别tm天天老子要下班了你来个单  '},
        {id: 136, barage: '天天这几句尬逼语录复制粘贴，脑壳里装的是脑浆我觉得就做不出来这种事，尬逼一群  '},
        {id: 137, barage: '头戴三清🙏脚踏万兵🤲正调北斗🤘左调七星🤙金光速现👌覆护真人👇急急如律令 输  '},
        {id: 138, barage: '外卖员发现主播点小份塔斯汀当晚饭，心疼偷偷地升级成大份并留言：吃大份去吧  '},
        {id: 139, barage: '洧妏采沵僦隂陽怪氣，莈妏采沵僦復淛秥萜，莂讓沵哪個b掱娴着，適個矗譒簡芣養娴亾  '},
        {id: 140, barage: '温馨提示：检测到你的情绪不稳定，可能是因为您大脑中的尼古丁含量较低，建议你马上整一根  '},
        {id: 141, barage: '我不知道互联网恶意为什么这么大，几千人对着一个带有明显智力障碍的人恶语相向  '},
        {id: 142, barage: '我不知道你为什么一定要想办法去说服一个智力有明显缺陷的CS2玩家  '},
        {id: 143, barage: '我是来自浙江余姚市的宝宝。名字叫叶枝高，曾效力于New4 Nface 拿过许许多多不同的冠军  '},
        {id: 144, barage: '我问大师 主播是什么水平？大师指了指旁边炉子上正在烧的水 我问：开了？ 大师：沸物  '},
        {id: 145, barage: '我问菩萨为什么那么多人骂主播，菩萨问我骂了没，我说没有我是房管，菩萨说卧槽帮我解一下  '},
        {id: 146, barage: '我先睡了真不是害怕明天要高考🥵🥵🥵我先睡了真不是害怕明天要高考🥵🥵🥵  '},
        {id: 147, barage: '我在＃给主播请神 活动中请到了qu神，获得了神之赐z！dgq加冕为椰“Z”膏！你也来试试吧～  '},
        {id: 148, barage: '我在“不骂冬瓜强”活动中坚持了60秒，获得称号《是没键盘还是没手》，你也来试试吧。  '},
        {id: 149, barage: '我在“清君侧”活动中清除反贼“Big茄子”，帮助主播成为csgo一哥，你也快来试一试  '},
        {id: 150, barage: '我在“世界养猪大赛”中养出了猪王“椰汁糕冬瓜强”，点击+1  '},
        {id: 151, barage: '我组了个商队去行商，路上途径沙漠决定用骆驼运货，问骆驼商几只够用，他指了指冬瓜：一驼够使  '},
        {id: 152, barage: '卧槽哥们你装啥b装的太像了，把大伙都骗了，弹幕都在喷你是啥b，我tm以为你真是啥  '},
        {id: 153, barage: '卧槽哥们你装啥b装的太像了，把大伙都骗了，弹幕都在喷你是啥b，我tm以为你真是啥  '},
        {id: 154, barage: '卧槽我什么时候关注的这主播？那天偶然看到在播apex就点进来了，现在在玩的这是什么无聊游戏  '},
        {id: 155, barage: '卧槽兄弟你操作太牛了 真想给你刷个飞机 但我是穷哥们 只能打给你了  '},
        {id: 156, barage: '吴权清❤️叶志高🧡苏麒芳💙许昊文💛袁瑞斌💚王祎楠💜刘亦博🖤赖雪峰💖吴润波  '},
        {id: 157, barage: '系统提示：您在不骂冬瓜强的活动中坚持了一分钟，获得称号“没键盘还是没手。”  '},
        {id: 158, barage: '香烟入嘴，七分化作操作。剩下的三分，啸成了怒火。B嘴一吐，便是半个余姚。《忆瓜强》  '},
        {id: 159, barage: '小将😭钙奶😭麒芳😭藏原走😭小葡萄😭橘子可😭龙😭明神😭左神😭  '},
        {id: 160, barage: '小团体一个京✌🏻八套房，一个云南大象王，就你是个余姚讲述人  '},
        {id: 161, barage: '小仙鸟丶QUQU：集美们，咱就是说这么好的游戏，竟然不带我玩？整个一个胡闹的大动作！  '},
        {id: 162, barage: '新来的白字不会编段子 可以先从简单的人身攻击开始 不要什么都不做 直播间不养闲人  '},
        {id: 163, barage: '馨儿真的要嫁给🐱吗  '},
        {id: 164, barage: '哑鸟丶QUQU：  '},
        {id: 165, barage: '椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕  '},
        {id: 166, barage: '椰汁糕，余姚人，职业下包手，职业期间夺冠无数，2022夺得个人生涯最具含金量冠军-新冠  '},
        {id: 167, barage: '叶枝高，出了名了不回老同学消息了，明天我们中专模具班聚会你来不来，有董小倩  '},
        {id: 168, barage: '叶枝高，我是李丽你还记得初三那会儿你偷我奶兜子的事吗？我昨天离婚了你现在还喜欢我吗  '},
        {id: 169, barage: '叶枝高我是你高中女同桌董小倩 以前上课老掀我裙子 你还记得吗  '},
        {id: 170, barage: '叶志高，我是余姚三中王龙，初中踢你进粪坑那个，最近混得不错，有空聚聚  '},
        {id: 171, barage: '一直教有什么意思 主播会记得你是谁？ 老老实实看他小丑得了 这样永远都是你骂他  '},
        {id: 172, barage: '泳裤骂过娘，刘頔发过狂，小鬼流过氓，茄子称过王，苏弟破过房，超哥刀过狼，冬瓜吃过翔  '},
        {id: 173, barage: '有！绿！色！贝！雷！蛙！那！我！就！不！闹！了！  '},
        {id: 174, barage: '有没有姐妹也看不懂游戏，但很吃我们瓜瓜颜的，蹲蹲（˵¯͒¯͒˵)  '},
        {id: 175, barage: '有人复制一下我的弹幕吗，我也想躲在被子里偷笑  '},
        {id: 176, barage: '有些弹幕真的是目光短浅，看见主播发挥不好就开始嘲笑，等着吧，更好笑的还在后头呢！  '},
        {id: 177, barage: '有些彈幕蠻婆媽的，台胞的發言都有在裝吼，再講古怪，林北壹巴掌送妳壹個咚咚锵  '},
        {id: 178, barage: '有着易峰的忠贞，亦凡的节欲，丁真的智慧，劲夫的温柔，志祥的专一，关注低级Q永远不悔  '},
        {id: 179, barage: '鱼越大，鱼刺越大，鱼刺越大，鱼肉越少，鱼肉越少，鱼越小，所以鱼越大，鱼越小  '},
        {id: 180, barage: '豫鸟丶QUQU：噫，老翔，不中嘞，恁好玩嘞游戏咋不叫俺啊，去球吧。  '},
        {id: 181, barage: '原创弹幕也是有知识产权的 我辛苦想出的弹幕 你+1就变成你的了 小心我告你侵权  '},
        {id: 182, barage: '粤鸟丶QUQU：叼你滷味，尼個直播間真係好閪撚正，可以係咁叼柒主播，好鸠过瘾  '},
        {id: 183, barage: '怎么还有人教啊，你说错了他嘲讽你，你说对了他觉得自己厉害，不如直接人身攻击他屁都不敢放  '},
        {id: 184, barage: '这弹幕不是俺偷嘞，是俺看别人发出来俺复制嘞，俺以为没人要嘞  '},
        {id: 185, barage: '这种劣迹斑斑屡教不改的主播，每天就是警告两下就没了，唬弄谁？有意思？对斗鱼失望  '},
        {id: 186, barage: '这种主播，有一股媚劲，真不是一般的小男生能比的。要说媚在哪儿，那就是媚有脑子  '},
        {id: 187, barage: '主播的队友真猛，像赵云一样七进七出，当然主播也很棒，在怀里没哭  '},
        {id: 188, barage: '主播面对满屏的嘲讽和挖苦。他总是默默看着。从来不回应和解释。因为他明白弹幕说的都是真的  '},
        {id: 189, barage: '主播是典型的名气大于实力，你要问主播有什么名气，确实没有，但也大于实力  '},
        {id: 190, barage: '主播我给你引流了，我刚刚点了两下举报说会有人持续关注你  '},
        {id: 191, barage: '主播这个🔴还给你，以后记得不要把鼻子掉到地上哦🤡  '},
        {id: 192, barage: '装备最好，杀人最少，年龄最老，对枪就倒，死了低头，手机玩饱，问我是谁，斗鱼瓜宝  '},
        {id: 193, barage: '做好自己就OK了，不用管他人的闲言碎语，他们骂你，你就当他们骂的是狗  '},
        {id: 194, barage: '我接受大家的批评同时也给大家一个直接明确的交代，我现在的状态是：刘頔'},
        {id: 195, barage: '袁瑞斌就是那种会哭着打奶嗝，眼睛会泛着水光的小奶狗一枚呀，软软的，浑身奶香'},
        {id: 196, barage: '《我要刘迪了》《直接刘迪了》《刘迪两天》《忘了 刘迪两口》《闻闻刘迪》《不管了刘了迪了》'},
        {id: 197, barage: '一天刘顿被刘迪砸到了脑袋，从而发现了刘迪力学'},
        {id: 198, barage: '有文采你就刘頔，没文采你就刘頔，别让你那刘頔闲着，这个直播间不养刘頔'},
  
      ],  
      randomlySelectedItem: null
    };
  },
  methods: {
    getRandomItem() {
      if (this.items.length > 0) {
        const randomIndex = Math.floor(Math.random() * this.items.length);
        this.randomlySelectedItem = this.items[randomIndex];
      }
    }
  },
  created() {
    this.getRandomItem();
  },
  computed: {
    filteredItems() {
      return this.searchQuery ? this.items.filter(item =>
          item.barage.toLowerCase().includes(this.searchQuery.toLowerCase())
      ) : [];
    }
  }

};


</script>

<script setup>

const open2 = () => {
  ElMessage({
    message: '复制成功',
    type: 'success',
  })
};

const open4 = () => {
  ElMessage.error('复制失败，请检查浏览器是否禁用navigator.clipboard对象或手动复制,请勿使用夸克浏览器')
};

const copyText = (text) => {
  navigator.clipboard.writeText(text)
      .then(() => {
        // 复制成功，可以显示提示信息  
        open2();
        console.log('内容已复制到剪贴板');
      })
      .catch((err) => {
        // 复制失败，可以显示错误信息  
        console.error('复制失败:', err);
        open4()
      });
};


</script>

<style>

</style>