<template>
  <div>
    <div class="card" style="line-height: 30px">
      <div><b>2024年2月28日，恭喜LVG晋级major，季冬凯你是我爹！！</b></div>
    </div>

    <div class="card" style="line-height: 30px; margin-top:8px ;"> 
      <p>你好，各位白字。 <br>  
    这是一个收集厕所弹幕的网站: <span style="font-size: 24px; font-weight: bold; color: red;">DGQ63136.icu</span> <br>  
    请记住我！I see you~ <br>网站制作: <b>强哥咱跟她干吧</b></p>
    </div>

    <div class="card" style="line-height: 50px ;margin-top: 8px;">
      <div>
        <!-- <div class="button-table-container"><el-tag type="success">点击下面按钮随机弹幕</el-tag></div> -->
        <el-button type="primary" @click="getRandomItem" >点我随机一条弹幕</el-button>
        <el-table v-if="randomlySelectedItem" :data="[randomlySelectedItem]" style="font-family: 微软雅黑;font-size: 20px;">
          <el-table-column prop="barage" label="弹幕" ></el-table-column>
          <el-table-column label="" align="center" width="160">
            <template #default="scope">
              <el-button type="primary" @click="copyText(scope.row.barage)">复制</el-button>
            </template>
          </el-table-column>
        </el-table>
        <div v-else>
          <p>未选择随机项</p>
        </div>
      </div>
    </div>

    <div class="card" style="line-height: 50px ;margin-top: 10px ;margin-bottom: 10px; min-height: 120px;">
      <div style="font-size: 80px;">
              
        <el-input v-model="searchQuery" placeholder="搜索弹幕..." style="font-size: 25px; margin-top: 28px;">
          <template slot="append">
            <el-button icon="el-icon-search"></el-button>
          </template>
        </el-input>
        <el-table v-if="searchQuery" :data="filteredItems" stripe>
          <el-table-column prop="barage" label="弹幕" display:none></el-table-column>
          <el-table-column label="" align="center" width="160">
            <template #default="scope">
              <el-button type="primary" @click="copyText(scope.row.barage)">复制</el-button>
            </template>
          </el-table-column>
        </el-table>

      </div>
    </div>

    <div class="card" style="line-height: 100px ;margin-top: 8px; text-align: center;">
      <a href="https://www.wjx.cn/vm/P9UjaRI.aspx# " target="_blank" style="font-size: 25px;">我有更好的弹幕！点击投稿！！</a>
    </div>

  </div>
</template>

<script>

export default {
  data() {
    return {
      searchQuery: '',
      items: [
        {id: 1, barage: '2022年11月16日晚20:40分冬瓜强5EPL0.17rating'},
        {id: 2, barage: '2024年1月10日23点29分  冬瓜强警长一刀带走五个好人 警钟长鸣'},
        {id: 3, barage: '2023.11.28晚十一点二十分，冬瓜强引爆地雷炸死京爷阿乐自己共三人，警钟长鸣！'},
        {id: 4, barage: '2023年10月23日04:07分，冬瓜强自爆爆皮过长，警钟长鸣'},
        {id: 5, barage: '2023年11月15日01:39:35 冬瓜 刘頔 超哥 被小夹子美人计一石三杀，警钟长鸣'},
        {id: 6, barage: '2023年12月22日1:59，冬瓜强搂喜欢算，差3块葬送8千存款，警钟长鸣！'},
        {id: 7, barage: '2023年12月26日22点53分35秒，冬瓜强身为连环杀手一刀没出反而进入狼坑，警钟长鸣！'},
        {id: 8, barage: '2023年12月29日22:08冬瓜强加拿大鹅在14个人中报身份给刺客XF，警钟长鸣'},
        {id: 9, barage: '2023年12月29日22:59，老叶发出感叹：这么蠢的刺客吗？（冬瓜强-刺客-饮弹自尽）'},
        {id: 10, barage: '2023年1月11号2点46分阿胖锐评冬瓜强是软香蕉🍌警钟长鸣'},
        {id: 11, barage: '2023年1月4日0点16分27秒，苏迪、刘頓、冬瓜决赛圈三打一荣获第二名，警钟长鸣！'},
        {id: 12, barage: '2023年2月17号17点45分 阿胖锐评冬瓜强因为阿胖不陪他打针半夜一两点掉小珍珠'},
        {id: 13, barage: '2023年3月18日2点29分 冬瓜 茄子 lisa jee 决赛圈四打一被反杀，警钟长鸣'},
        {id: 14, barage: '2023年3月23日23点26分刘頔《尿我身上吧》 警钟长鸣！'},
        {id: 15, barage: '2023年5月7日19:51分HHJ选用貂蝉获得2.5分！警钟长鸣'},
        {id: 16, barage: '2023年6月29日2:28 冬瓜超哥刘頔钙奶马飞 瓦0：13 警钟长鸣'},
        {id: 17, barage: '2023年9月17日00:04:17 批高户外看女主播流哈喇子，并表示独占63136'},
        {id: 18, barage: '2024年1月8日19：52冬瓜发誓再骂超哥就抽自己脸警钟长鸣'},
        {id: 19, barage: '2024年2月24日凌晨1:06分，冬瓜强和超哥拍摄《重生真妙》上中下三集，警钟长鸣'},
        {id: 20, barage: '@JaLEn半仙：瓜强，我这里有锁匠任务'},
        {id: 21, barage: '“猪手一双，蹄子两双，胡言乱语，脑子煲汤，全身上下，猪头最香，赢了纯躺，输了还装'},
        {id: 22, barage: '《藏头诗》冬瓜强一坨史，瓜强一坨史，强一坨史，一坨史，坨史，史'},
        {id: 23, barage: '《后室更新了》《明天就后室》《等刘迪结束就后室》《再刷后室杀了》'},
        {id: 24, barage: '《明天后室》是由冬瓜强指导，为游戏《后室》设计的DLC，将于明天上线。'},
        {id: 25, barage: '《是的，直升机》《对的，肘击》《牛的，牢大》《卧槽里的，黄色冰红茶》'},
        {id: 26, barage: '《我要戒烟了》《直接扔了》《戒两天》《忘了 把两口》《闻闻味道》《不管了死了得了》'},
        {id: 27, barage: '《邀功声明》主播本次精彩高效行动纯属听取本人指挥。主播只是代为执行。所有荣耀归本人所有。'},
        {id: 28, barage: '《以后俩小时把一根，兄弟们帮我监督》《我说戒烟，就肯定会戒了》《我再抽我就是丧狗》'},
        {id: 29, barage: '✋停✋止✋这✋场✋闹✋剧✋吧✋✋停✋止✋这✋场✋闹✋剧✋吧✋'},
        {id: 30, barage: '⚡😎享受⚡😎⚡😎享受⚡😎⚡😎享受⚡😎⚡😎享受⚡😎⚡😎享受⚡😎'},
        {id: 31, barage: '🍚🥢🐷哼哧哼哧🍚🥢🐷哼哧哼哧🍚🥢🐷哼哧哼哧🍚🥢🐷哼哧哼哧'},
        {id: 32, barage: '👊🏿男人 哈哈哈，🎤什么可以我说？🚁曼巴 👉🏿出去！'},
        {id: 33, barage: '👍😀天才👍😀天才👍👍😀天才👍😀天才👍👍😀天才👍😀天才👍'},
        {id: 34, barage: '💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃'},
        {id: 35, barage: '🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬'},
        {id: 36, barage: '🧡甜💛瓜💚西💙瓜💜哈🧡蜜💜瓜💚不💛爱🧡冬💛瓜❤️是💗傻🤎瓜'},
        {id: 37, barage: '蔡徐坤❤陈立农❤范丞丞❤黄明昊❤林彦俊❤朱正廷❤王子异❤王琳凯❤尤长靖❤️冬瓜强'},
        {id: 38, barage: '抽的越多,肺癌越早.肺癌越早,活的越少.活的越少,抽的越少.所以抽的越多抽的越少'},
        {id: 39, barage: '冬瓜别气，喝奶奶🍼🍼🍼🍼🍼冬瓜别气，喝奶奶🍼🍼🍼🍼🍼'},
        {id: 40, barage: '刚来，谁窥？谁针对？谁在 捂眼喊撤退？谁混？谁内鬼？谁的玩法不团队？谁又没有人情味？'},
        {id: 41, barage: '给点吧😭🤲给点吧😭🤲给点吧😭🤲给点吧😭🤲给点吧😭🤲'},
        {id: 42, barage: '瓜强你声音小点我男朋友睡着了把他喊醒了他又要弄我'},
        {id: 43, barage: '怪不得你有自信开摄像头 你这样的猪🐷到双汇和金锣哪不是顶级食材啊'},
        {id: 44, barage: '好🥬，看得好爽😋！好🥬，看得好爽🥳！好🥬，看得好爽😋！好🥬，看得好爽🥳'},
        {id: 45, barage: '呼，瓜酱の笑颜、就算是我这样「卑·微」の肥宅，也想要一直守护！欺负瓜酱的事情、是绝对——达咩哟！'},
        {id: 46, barage: '急死了都🥵急死了都🥵急死了都🥵急死了都🥵急死了都🥵急死了都🥵急死了都🥵'},
        {id: 47, barage: '家人们，家人们，9敏🆘🆘，我真的会谢❗❗❗大无语事件发生，咱就是说最近在小红薯发现'},
        {id: 48, barage: '叫兄弟太亲密，叫主播太生疏，叫homie太崇洋，叫宝贝太油腻，晚上好儿子'},
        {id: 49, barage: '今天登了女儿斗鱼🌹看看女儿平时刷些什么🌹是你我就放心了🌹男人就该像你这样🌹'},
        {id: 50, barage: '老哥们，我多嘴问一句，我可以多嘴问一句吗，如果可以，那我多嘴问一句，我多嘴吗？'},
        {id: 51, barage: '米娜玩个大富翁混一混都有四千贵宾，隔壁冬瓜强奶都要摇掉了才五千贵宾'},
        {id: 52, barage: '明天我中忍考试了，你可以跟我签订通灵契约做我的忍犬吗'},
        {id: 53, barage: '那你无敌了呀?那你这运气谁能跟你比啊?那你太强了啊?那谁玩得过你啊'},
        {id: 54, barage: '那你无敌了呀🤡那你这运气谁能跟你比啊🤡那你太强了啊🤡那谁玩得过你啊'},
        {id: 55, barage: '你到底在自卑什么，像你这种品种的狗，在哪个宠物市场不是被抢购一空？'},
        {id: 56, barage: '你们男生是不是都好色啊？我在学校都不敢看你们，怕你们在心里把我那个了'},
        {id: 57, barage: '你们这帮傻波一弹幕电死你们⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟'},
        {id: 58, barage: '你要怪我偷你外卖，那我还要问你为什么要点外卖呢，点了外卖还想吃外卖？好事怎么都让你占了'},
        {id: 59, barage: '尿越多，肾越差，肾越差，尿越频，尿越频，尿越少，所以，尿越多，尿越少'},
        {id: 60, barage: '穷玩车富玩表，没钱我就玩玩鸟，对着瓜瓜岛一岛，舒服一秒是一秒'},
        {id: 61, barage: '人越多，+1越多，+1越多，人越烦，人越烦，人越少，所以，人越多，人越少'},
        {id: 62, barage: '上一天班烦死了！😡还好有你叶志高我****！'},
        {id: 63, barage: '實況主可以喘小聲些嗎,林北的咕咕bird都快爆掉了,沒在誇張的'},
        {id: 64, barage: '虽然主播的外观、智力水平、生活习性等与猪高度类似，但仍不能排除主播是人类的可能性'},
        {id: 65, barage: '塔斯汀余姚万达店：你要点就现在点，别tm天天老子要下班了你来个单'},
        {id: 66, barage: '头戴三清🙏脚踏万兵🤲正调北斗🤘左调七星🤙金光速现👌覆护真人👇急急如律令 输'},
        {id: 67, barage: '外卖员发现主播点小份塔斯汀当晚饭，心疼偷偷地升级成大份并留言：吃大份去吧'},
        {id: 68, barage: '洧妏采沵僦隂陽怪氣，莈妏采沵僦復淛秥萜，莂讓沵哪個b掱娴着，適個矗譒簡芣養娴亾'},
        {id: 69, barage: '温馨提示：检测到你的情绪不稳定，可能是因为您大脑中的尼古丁含量较低，建议你马上整一根'},
        {id: 70, barage: '我不知道互联网恶意为什么这么大，几千人对着一个带有明显智力障碍的人恶语相向'},
        {id: 71, barage: '我不知道你为什么一定要想办法去说服一个智力有明显缺陷的CS2玩家'},
        {id: 72, barage: '我问大师 主播是什么水平？大师指了指旁边炉子上正在烧的水 我问：开了？ 大师：沸物'},
        {id: 73, barage: '我问菩萨为什么那么多人骂主播，菩萨问我骂了没，我说没有我是房管，菩萨说卧槽帮我解一下'},
        {id: 74, barage: '我先睡了真不是害怕明天要高考🥵🥵🥵我先睡了真不是害怕明天要高考🥵🥵🥵'},
        {id: 75, barage: '我在“清君侧”活动中清除反贼“Big茄子”，帮助主播成为csgo一哥，你也快来试一试'},
        {id: 76, barage: '我组了个商队去行商，路上途径沙漠决定用骆驼运货，问骆驼商几只够用，他指了指冬瓜：一驼够使'},
        {id: 77, barage: '卧槽我什么时候关注的这主播？那天偶然看到在播apex就点进来了，现在在玩的这是什么无聊游戏'},
        {id: 78, barage: '卧槽兄弟你操作太牛了 真想给你刷个飞机 但我是穷哥们 只能打给你了'},
        {id: 79, barage: '香烟入嘴，七分化作操作。剩下的三分，啸成了怒火。B嘴一吐，便是半个余姚。《忆瓜强》'},
        {id: 80, barage: '一直教有什么意思 主播会记得你是谁？ 老老实实看他小丑得了 这样永远都是你骂他'},
        {id: 81, barage: '有没有姐妹也看不懂游戏，但很吃我们瓜瓜颜的，蹲蹲（˵¯͒¯͒˵)'},
        {id: 82, barage: '有些弹幕真的是目光短浅，看见主播发挥不好就开始嘲笑，等着吧，更好笑的还在后头呢！'},
        {id: 83, barage: '有些彈幕蠻婆媽的，台胞的發言都有在裝吼，再講古怪，林北壹巴掌送妳壹個咚咚锵'},
        {id: 84, barage: '有着易峰的忠贞，亦凡的节欲，丁真的智慧，劲夫的温柔，志祥的专一，关注低级Q永远不悔'},
        {id: 85, barage: '鱼越大，鱼刺越大，鱼刺越大，鱼肉越少，鱼肉越少，鱼越小，所以鱼越大，鱼越小'},
        {id: 86, barage: '怎么还有人教啊，你说错了他嘲讽你，你说对了他觉得自己厉害，不如直接人身攻击他屁都不敢放'},
        {id: 87, barage: '这种劣迹斑斑屡教不改的主播，每天就是警告两下就没了，唬弄谁？有意思？对斗鱼失望'},
        {id: 88, barage: '这种主播，有一股媚劲，真不是一般的小男生能比的。要说媚在哪儿，那就是媚有脑子'},
        {id: 89, barage: '主播是典型的名气大于实力，你要问主播有什么名气，确实没有，但也大于实力'},
        {id: 90, barage: '主播我给你引流了，我刚刚点了两下举报说会有人持续关注你'},
        {id: 91, barage: '装备最好，杀人最少，年龄最老，对枪就倒，死了低头，手机玩饱，问我是谁，斗鱼瓜宝'},
        {id: 92, barage: '做好自己就OK了，不用管他人的闲言碎语，他们骂你，你就当他们骂的是狗'},
        {id: 93, barage: '有文采你就刘頔，没文采你就刘頔，别让你那刘頔闲着，这个直播间不养刘頔'},
        {id: 94, barage: '主播 骂你的人太多了 我举报不过来 我直接把直播间举报了 端了他们老巢'},
        {id: 95, barage: '没办法，这种情况是真的没一点办法。但凡有一点办法也不至于一点办法也没有'},
        {id: 96, barage: '不攻击主播的建议买张高铁票到成都东转动车到乐山坐3路到大佛寺站下，叫坐着的那位起来你坐'},
        {id: 97, barage: '你现在可以选择不攻击主播，但当主播破防了开始无差别攻击弹幕时，别在这里委屈'},
        {id: 98, barage: '这把还有黑点？弹幕属实尬黑了（IP属地：四川省乐山市乐山大佛景区)'},
        {id: 99, barage: '嘿嘿☺️…这波有点小帅…偷偷瞄一下弹幕👀（😡怎么都是在骂的）'},
        {id: 100, barage: '这个直播间的氛围真的好融洽，简直像是一家三代：儿子在玩，爸爸在教，爷爷在看'},
        {id: 101, barage: '一拳捣死你👊😡👊一拳捣死你👊😡👊一拳捣死你👊😡👊一拳捣死你👊😡👊'},
        {id: 102, barage: '今日若我冷眼旁观，他日祸临己身，则无人为我摇旗呐喊！放人！'},
        {id: 103, barage: '开抽🤡🚬嘶🤡🚬嘶🤡🚬嘶🤡🚬嘶🤡🚬嘶🤡🚬嘶🤡🚬嘶'},
        {id: 104, barage: '有文化你就阴阳怪气，没文化你就人身攻击，别搞得像没手没键盘，主播破防时不会放过你的'},
        {id: 105, barage: '我在不骂主播活动中坚持了17秒，获得称号《没键盘还是没手？》你也来试试吧'},
        {id: 106, barage: '刮墙面对满屏的嘲讽和挖苦。他总是默默看着。从来不回应和解释。因为他明白弹幕说的都是真的'},
        {id: 107, barage: 'ququ有流星，小鬼有这谁，你只有sb深海鱼ququ有流星，小鬼有这谁，你只有sb深海鱼'},
        {id: 108, barage: '想做瓜瓜的photoshop，这样就能狠狠的设瓜瓜的比例了'},
        {id: 109, barage: '想变成瓜瓜的凉鞋，这样瓜瓜酸酸臭臭的小脚践踏我的时候我就能吮吸他酸酸甜甜的脚汗了'},
        {id: 110, barage: '誒？   主播开团是吧  粉丝发言上升主播素质吗？  上升的话我就火力全开了'},
        {id: 111, barage: '十枪九空，落得八场七负，六胜五躺，却骂四个憨批队友，三番两次破防，我看阁下啥比一'},
        {id: 112, barage: '⎛⎝≥⏝⏝≤⎠⎞⎛⎝｡◕‿◕｡⎠⎞ ⎛⎝≥⏝⏝≤⎠⎞⎛⎝｡◕‿◕｡⎠⎞'},
        {id: 113, barage: '钱挣了 大房子有了 有漂亮老婆了 不愿意穿旺仔衣服逗哥们了😭'},
        {id: 114, barage: '稀碎的枪法，错误的思路，匮乏的想象力，慌乱的抉择，每一帧都是笑柄，看你直播真是一种享受'},
        {id: 115, barage: '老子挂直播间睡觉了，你搞耍可以，但是不要突然大吼大叫，惊了老子睡觉就喷你，听到没有'},
        {id: 116, barage: '@Minana呀:请问你连续几天在我直播间发“继续摇晃就好”和“练枪时间'},
        {id: 117, barage: '瓜强啊，我从大学看你直播到现在工作， 大学那会没钱没刷礼物，现在工作有钱了我'},
        {id: 118, barage: '《导一下》《嗯》《卧槽》《牛逼》《完了》《55 54 53 52》《ok》《我超哥呢》'},
        {id: 119, barage: '瓜强我陪你一根 嘶~~้้้้๎๎๎๎้้้้๎๎้้้้๎๎๎๎้้้้๎๎๎๎้้้้้้'},
        {id: 120, barage: '▷ ︎ı¦¦ııı¦¦ı¦ 2” 转化成文字：FW'},
        {id: 121, barage: 'ィ亭✋祉✋這✋cんǎnɡ✋閙✋居リ✋ロ巴✋ィ亭✋祉✋這✋cんǎnɡ✋閙✋居リ✋ロ巴✋'},
        {id: 122, barage: '◥▇▇▆▆▅▅◙▬▬▬▬▬▬▬▬▬▬▬▬▬————批瓜看刀'},
        {id: 123, barage: '她擦不擦边我知道，现实中没人愿意给我看，她一个陌生人却愿意给我看，这不是擦边，这是在给基层送温暖'},
        {id: 124, barage: '你现在可以选择不攻击主播，但当主播破防红温之后，别咧个B嘴笑觉得是自己的功劳'},
        {id: 125, barage: '@Xleft小叮当:你是怎么做到看起来很忙。一点用没有的？'},
        {id: 126, barage: '@XTSZzZzz：这个游戏，不只有狼，还有很多🐷'},
        {id: 127, barage: '@阿乐fps：造李蛙！造李蛙！造李蛙！造李蛙！造李蛙！造李蛙！造李蛙！造李蛙！'},
        {id: 128, barage: '@冬瓜强的正宫娘娘阿胖:每晚都说弄死我,没过两分钟都把自己弄成死鱼'},
        {id: 129, barage: '@冬瓜强的正宫娘娘啊胖：如果你再不戒烟，那个B橡胶圈你就带一辈子！'},
        {id: 130, barage: '@精神永富:这些片总只是第一波嗷瓜强，别觉得踢了我能好过。'},
        {id: 131, barage: '@馒头:冬瓜强你大主播，你了不起，你清高，你就打压我吧，我就是要一步一步一步一步爬到最高'},
        {id: 132, barage: '@娆春乔:冬瓜，去！给我叼回来！🦴🦴🦴🦴🦴'},
        {id: 133, barage: '@吴尚泽123：强弟，我是不是给你脸了，明天就叫我爸爸打压你'},
        {id: 134, barage: '@吴尚泽123:强叔，你真fw'},
        {id: 135, barage: '@杨一歌 ： 游戏看不懂，帅脸看不到，就知道抽抽抽，死了得了人夫哥'},
        {id: 136, barage: '@钻粉十级牌进群私信我：冬瓜强我是不是给你脸了？再骂一句试试？'},
        {id: 137, barage: '《刘迪更新了》《明天就刘迪》《等刘迪结束就刘迪》《再刷刘迪杀了》'},
        {id: 138, barage: '꧁✨❤瑞斌瑞斌，直击我心❤✨꧂꧁✨❤瑞斌瑞斌，直击我心❤✨꧂꧁✨❤瑞斌瑞斌，直击我心❤✨꧂'},
        {id: 139, barage: 'Newhappy明明：强哥战地还玩吗？不玩我退款了，买了一次都不叫我玩'},
        {id: 140, barage: '🐱🎈：冬瓜别玩了,我在后室里等你了。'},
        {id: 141, barage: '🐱真的要娶馨儿么'},
        {id: 142, barage: '💖꧁麒芳麒芳，举世无双꧂💖💖꧁麒芳麒芳，举世无双꧂💖💖꧁麒芳麒芳，举世无双꧂'},
        {id: 143, barage: '阿胖越胖，吃的越多，吃的越多，胃里空间越少，空间越少，吃的越少，阿胖越瘦，所以阿胖越胖，阿胖越瘦'},
        {id: 144, barage: '超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭超哥😭'},
        {id: 145, barage: '诶 你身上有炸弹哦！———Wegame世一吉格斯 绿色贝雷蛙 一键天赋已配备'},
        {id: 146, barage: '很难想象同样是尤物，猫就蠢的很幽默，冬瓜就蠢的很想骂，这是为什么呢？'},
        {id: 147, barage: '很喜欢老白的一句话 冬瓜强的残局过程很精彩 结局却往往不尽人意'},
        {id: 148, barage: '绝食鹈鹕，永生加拿大，无爪猎鹰，炸膛刺客，小脑警长，那你无敌了呀🤡'},
        {id: 149, barage: '扣1复活钙奶扣1复活钙奶扣1复活钙奶扣1复活钙奶扣1复活钙奶'},
        {id: 150, barage: '馒头平时打得多好，发多少枪，多么奉献。只要在冬瓜眼里失误一次，那就要被说一晚上'},
        {id: 151, barage: '没！有！红！烧！贝！雷！蛙！我！就！要！闹！'},
        {id: 152, barage: '没！有！京！✌🏻！我！就！要！闹！'},
        {id: 153, barage: '麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳😭麒芳'},
        {id: 154, barage: '我是来自浙江余姚市的宝宝。名字叫叶枝高，曾效力于New4 Nface 拿过许许多多不同的冠军'},
        {id: 155, barage: '小将😭钙奶😭麒芳😭藏原走😭小葡萄😭橘子可😭龙😭明神😭左神😭'},
        {id: 156, barage: '小团体一个京✌🏻八套房，一个云南大象王，就你是个余姚讲述人'},
        {id: 157, barage: '馨儿真的要嫁给🐱吗'},
        {id: 158, barage: '叶枝高，出了名了不回老同学消息了，明天我们中专模具班聚会你来不来，有董小倩'},
        {id: 159, barage: '泳裤骂过娘，刘頔发过狂，小鬼流过氓，茄子称过王，苏弟破过房，超哥刀过狼，冬瓜吃过翔'},
        {id: 160, barage: '有！绿！色！贝！雷！蛙！那！我！就！不！闹！了！'},
        {id: 161, barage: '大刘頔啦，漂亮刘頔娶了，大刘頔住上了，C刘頔开上了，嫌刘頔们烦了'},
        {id: 162, barage: '我接受大家的批评同时也给大家一个直接明确的交代，我现在的状态是：刘頔'},
        {id: 163, barage: '袁瑞斌就是那种会哭着打奶嗝，眼睛会泛着水光的小奶狗一枚呀，软软的，浑身奶香'},
        {id: 164, barage: '《我要刘迪了》《直接刘迪了》《刘迪两天》《忘了 刘迪两口》《闻闻刘迪》《不管了刘了迪了》'},
        {id: 165, barage: '一天刘顿被刘迪砸到了脑袋，从而发现了刘迪力学'},
        {id: 166, barage: '解说队伍：激情泳裤，呐喊茄子，专业卡萨，热情钙奶，哎哟馒头，完了刘迪，读秒冬瓜'},
        {id: 167, barage: '瑞斌♥瑞斌♥直击我心♥'},
        {id: 168, barage: '京✌就像公园里一件事能叨逼叨一天的大爷，冬瓜就厉害了，是大爷不牵绳的狗'},
        {id: 169, barage: '不怕渣女玩暧昧，就怕瑞斌三十岁，识大体 懂进退 撒娇卖萌全都会 解风情有韵味让人迷恋又沉醉'},
        {id: 170, barage: '我在“争夺余姚公主”活动中，使用了角色袁瑞斌，最终不敌洛宝，被瓜强关进地下室。你也来试我在“争夺余姚公主”活动中，使用了角色袁瑞斌，最终不敌洛宝，被瓜强关进地下室。你也来试试吧'},
        {id: 171, barage: '不是，我骂你几句怎么啦？你还不愿意听了？不是为你好？我咋不骂苏弟呢？'},
        {id: 172, barage: '+1可以，但是请你们+1的时候标注+1的是谁的弹幕，请尊重弹幕著作'},
        {id: 173, barage: 'α这是阿尔法，β这是贝塔，γ这是伽玛，δ这是德尔塔，ε这是我亲瓜瓜的小嘴巴'},
        {id: 174, barage: '🤖机器人测试弹幕，请机器人🤖自行+1，+1的都是机器人🤖'},
        {id: 175, barage: '此弹幕用于统计原神玩家，请原神玩家看到此弹幕后+1'},
        {id: 176, barage: '加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！'},
        {id: 177, barage: '老子真想把设计这个加一过快，请稍后再试的b一刀杀了！'},
        {id: 178, barage: '您的账号在另一地点登录，弹幕连接已断开 点击重新连接弹幕'},
        {id: 179, barage: '天天这几句尬逼语录复制粘贴，脑壳里装的是脑浆我觉得就做不出来这种事，尬逼一群'},
        {id: 180, barage: '我在“不骂冬瓜强”活动中坚持了60秒，获得称号《是没键盘还是没手》，你也来试试吧。'},
        {id: 181, barage: '我在“世界养猪大赛”中养出了猪王“椰汁糕冬瓜强”，点击+1'},
        {id: 182, barage: '卧槽哥们你装啥b装的太像了，把大伙都骗了，弹幕都在喷你是啥b，我tm以为你真是啥'},
        {id: 183, barage: '系统提示：您在不骂冬瓜强的活动中坚持了一分钟，获得称号“没键盘还是没手。”'},
        {id: 184, barage: '有人复制一下我的弹幕吗，我也想躲在被子里偷笑'},
        {id: 185, barage: '原创弹幕也是有知识产权的 我辛苦想出的弹幕 你+1就变成你的了 小心我告你侵权'},
        {id: 186, barage: '这弹幕不是俺偷嘞，是俺看别人发出来俺复制嘞，俺以为没人要嘞'},
        {id: 187, barage: '＋1这个b功能真应该关了，辛苦想出来的弹幕点一下就变成别人的了，一点版权意识都没'},
        {id: 188, barage: '你还在为打字慢而发愁吗，还在为跟不上弹幕节奏而难过吗，点击“➕1”摆脱困境，享受快乐。'},
        {id: 189, barage: '好久没看了，请问现在还有复制弹幕带ID的绝绝子吗'},
        {id: 190, barage: '白字来上厕所连厕纸都不买😅（别复制爷弹幕自己会发）'},
        {id: 191, barage: '爽！😎这才叫音乐！😋👍爽！😎这才叫音乐！😋👍爽！😎这才叫音乐！😋👍'},
        {id: 192, barage: '让✋我✋们✋停✋止✋这✋场✋闹✋剧✋吧'},
        {id: 193, barage: '勒布朗来了🦍🏀🦍🏀🦍🏀🦍🏀🦍🏀🦍🏀🦍🏀'},
        {id: 194, barage: '不是，哥们，我说你也太势利了，老子不送礼物你就不谢的。你就不能随便编一个谢一下?'},
        {id: 195, barage: '不要一杀人就撇头看弹幕，跟我家的狗捡到棍子屁颠屁颠跑过来看着我一样'},
        {id: 196, barage: '实话实说，对他人的原创弹幕进行+1属于严重的剽窃行为，建议取消+1，同意的＋1'},
        {id: 197, barage: '红色是危险，蓝色是冷漠，绿色是伪装，紫色是神秘，橙色是愤怒，黑色是归宿，黄色发给我'},
        {id: 198, barage: '@冬瓜强的正宫娘娘啊胖:我在“世界养猪大赛”中养出了猪王“椰汁糕冬瓜强”，点击+1'},
        {id: 199, barage: '“再见了👋，水友们😎”冬瓜强潇洒地拨动马桶上的按钮，旋转着被冲走了。'},
        {id: 200, barage: '꧁✨❤枝高枝高，冲上云霄❤✨꧂꧁✨❤枝高枝高，冲上云霄❤✨꧂꧁✨❤枝高枝高，冲上云霄❤✨꧂'},
        {id: 201, barage: '0.17ratingの伝説,5eplの赤い悪魔!執睪葉一郎とは!'},
        {id: 202, barage: 'C63的声浪盖过了兄弟们的呼声 也掩盖了你的初心'},
        {id: 203, barage: '🧡甜💛瓜💚西💙瓜💜哈🧡蜜💜瓜💚不💛爱🧡冬💛瓜❤️是💗傻🤎瓜'},
        {id: 204, barage: '爱你嘴巴嘟嘟😘爱你睡觉呼呼😴爱你撒娇哭哭😭爱你冬瓜猪猪😍'},
        {id: 205, barage: '大主播了，漂亮老婆娶了，大豪宅住上了，C63开上了，嫌兄弟们烦了'},
        {id: 206, barage: '冬瓜哥，我只是玩玩梗而已，我真不是女大学生，别私信发我那些图片了，还有，你那个挺可爱的'},
        {id: 207, barage: '端午节女大学生在纠结吃甜粽还是咸粽，冬瓜说：吃我吧，我可甜可咸，是个杂粽！'},
        {id: 208, barage: '哥谭市里你最狂🤡，马戏团里你最忙🤡，麦当劳前你站岗🤡，扑克牌里大小王🤡，斗鱼公厕冬瓜强🤡'},
        {id: 209, barage: '给主播拍照📷：🐷（正面特写）🐖（侧面特写）🐽（局部放大）🥩（过年限定）'},
        {id: 210, barage: '好无聊，牵着我的电子宠物散散步————🤡▜▜▙（冬瓜强）（可以摸）（已嘎蛋）'},
        {id: 211, barage: '开开开😡→乱踩人🤪→发言结巴😰→被投出局😭→沉默😑→开开开😡'},
        {id: 212, barage: '看到满屏幕的弹幕都在阴阳瓜瓜，心里不是滋味，只有我知道瓜瓜的努力，加油没用的东西！'},
        {id: 213, barage: '骂冬瓜可能会被禁言 但是不骂冬瓜等于一直被禁言'},
        {id: 214, barage: '你❤️✨唱💗✨的💚✨什💖✨么💜✨J💞✨B💛玩❤️✨意❤️'},
        {id: 215, barage: '你可以不攻击主播，但是等主播破防无差别攻击的时候，你别在这委屈😣'},
        {id: 216, barage: '你们在这里喷主播，就好比往菜地里泼屎，主播非但不生气只会疯狂汲取营养'},
        {id: 217, barage: '市卫生所通知：叶志高先生，您于10月2日上午进行的公益行为“捐精”检测结果为：不合格'},
        {id: 218, barage: '塔斯汀余姚店：叶枝高，你TM点不点，每次我快关门你给我来一单，我***'},
        {id: 219, barage: '卧槽哥们你装啥b装的太像了，把大伙都骗了，弹幕都在喷你是啥b，我tm以为你真是啥'},
        {id: 220, barage: '吴权清❤️叶志高🧡苏麒芳💙许昊文💛袁瑞斌💚王祎楠💜刘亦博🖤赖雪峰💖吴润波'},
        {id: 221, barage: '椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕❤椰❤汁❤糕'},
        {id: 222, barage: '椰汁糕，余姚人，职业下包手，职业期间夺冠无数，2022夺得个人生涯最具含金量冠军-新冠'},
        {id: 223, barage: '叶枝高，我是李丽你还记得初三那会儿你偷我奶兜子的事吗？我昨天离婚了你现在还喜欢我吗'},
        {id: 224, barage: '叶枝高我是你高中女同桌董小倩 以前上课老掀我裙子 你还记得吗'},
        {id: 225, barage: '叶志高，我是余姚三中王龙，初中踢你进粪坑那个，最近混得不错，有空聚聚'},
        {id: 226, barage: '主播的队友真猛，像赵云一样七进七出，当然主播也很棒，在怀里没哭'},
        {id: 227, barage: '主播面对满屏的嘲讽和挖苦。他总是默默看着。从来不回应和解释。因为他明白弹幕说的都是真的'},
        {id: 228, barage: '主播这个🔴还给你，以后记得不要把鼻子掉到地上哦🤡'},
        {id: 229, barage: '又挡摄像头？你到底在自卑什么！像你这种品相的猪头肉放在哪个市场不是被抢购一空？'},
        {id: 230, barage: '我不复制我发什么？我像你一样饱读诗书满腹金轮随口就可以说出好玩的梗吗，复制都要被骂😭'},
        {id: 231, barage: '诞生于斗鱼公厕，梦想是go区一哥，喜欢喝百事的男孩，抽烟下包是他的王牌！ '},
        {id: 232, barage: '你吃东西动静小点，我家猪以为我偷喂别的猪，急的都把圈门拱破了'},
        {id: 233, barage: '《嗯》《卧槽》《牛逼》《完了》《55 54 53 52》《ok》'},
        {id: 234, barage: '0.17场上秀遇到敌人大喊救▜▜▙有点无聊就被溜‍dy63136'},
        {id: 235, barage: '白布一盖点蚊香，猛砸桌子嚼槟榔，你要问我他是谁，余姚脑瘫冬瓜强'},
        {id: 236, barage: '“虽然彩字踩在了我的头上，但反过来我也用舌头弄脏了他的鞋底”———白字'},
        {id: 237, barage: '①白字说话要加敬语，特别是对彩字②白字每条弹幕限制在3个字以内③彩字和彩字对话时白字不能插嘴'},
        {id: 238, barage: '🧹清理白字🧹清理白字🧹清理白字🧹清理白字🧹清理白字🧹清理白字'},
        {id: 239, barage: '红色是危险，蓝色是冷漠，绿色是伪装，紫色是神秘，橙色是愤怒，黑色是归宿,黄色发给我'},
        {id: 240, barage: '没有人一出生就是彩字，出生都是白字'},
        {id: 241, barage: '新来的白字不会编段子 可以先从简单的人身攻击开始 不要什么都不做 直播间不养闲人'},
        {id: 242, barage: '白字别太跳，表现好点，我可以带ID复制你弹幕，让你体验一次彩字的感觉'},
        {id: 243, barage: '谁急？谁破？谁BT？谁被杀了猛逼逼？谁的戒烟废火机？谁的房管是原批？谁的白字只加一'},
        {id: 244, barage: '！闹胡是就直简起一我带不，吧了思意够不太也这，瓜冬啊Z我：UQUQ丶鸟反'},
        {id: 245, barage: '@狂鸟丶QUQU：我Z啊冬瓜，这关你都不会啊？一个单向烟一个提溜闪不就过去了？'},
        {id: 246, barage: '@日鸟丶QUQU：私はZああ、とても面白い、冬瓜は私を連れて遊びに行かないでまるででたらめだ'},
        {id: 247, barage: '@偷鸟、ququ:我Z 啊，冬瓜，我都没偷你东西，干嘛打我，给你个Z，真是胡~~闹！'},
        {id: 248, barage: '@灣鳥丶QUQU：靠北啦，掛牆！醬紫好玩的遊戲不叫我是要怎樣吼！簡直就是胡！鬧！'},
        {id: 249, barage: '官鸟丶ququ：坚决落实一天一玩，一户一玩，应玩尽玩。让老百姓喜欢玩，爱上玩，怕不玩'},
        {id: 250, barage: '桀鸟丶ququ：我嬲咧，这么好的包点不埋我的金河田，简直就是瞎！装！机！'},
        {id: 251, barage: '京鸟丶QUQU：八套！北京我有八套房子！你敢跟我作对？我买你命啊！'},
        {id: 252, barage: '狂鸟丶ququ：我z啊冬瓜，这么好的比赛居然不叫我看，简直就是胡闹'},
        {id: 253, barage: '馒鸟丶QUQU：（喘）这么好玩的游戏不叫我，你们玩，我歇了，真没生气，哎哟（喘）'},
        {id: 254, barage: '我在＃给主播请神 活动中请到了qu神，获得了神之赐z！dgq加冕为椰“Z”膏！你也来试试吧～'},
        {id: 255, barage: '小仙鸟丶QUQU：集美们，咱就是说这么好的游戏，竟然不带我玩？整个一个胡闹的大动作！'},
        {id: 256, barage: '哑鸟丶QUQU：'},
        {id: 257, barage: '豫鸟丶QUQU：噫，老翔，不中嘞，恁好玩嘞游戏咋不叫俺啊，去球吧。'},
        {id: 258, barage: '粤鸟丶QUQU：叼你滷味，尼個直播間真係好閪撚正，可以係咁叼柒主播，好鸠过瘾'},
        {id: 259, barage: '如果是ququ的话一定会垫底roll把刀'},
        {id: 260, barage: '我在＃给主播请神 活动中请到了qu神，获得了神之赐z！dgq加冕为椰“Z”膏！你也来试试吧～'},
        {id: 261, barage: '嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟嘟'},
        {id: 262, barage: '@塔斯汀余姚店：你要点就现在点，别tm天天老子要下班了你来个单'},
        {id: 263, barage: '主播您好，我是您花钱买的水军，看了俩小时没找到一个能夸的点，您申请退款吧'},
        {id: 264, barage: '《免责声明》：本人在观看过程中没有发表指挥主播游戏操作的弹幕 主播破防后 请别误伤'},
        {id: 265, barage: '主播您好，我是您花钱买的水军，看了俩小时没找到一个能夸的点，您申请退款吧'},
        {id: 266, barage: '梅西好歹还在场边能看到，你直播间都看不到你人，你比梅西还牛逼'},
        {id: 267, barage: '《指出我的问题》《这是我的问题？》《我有什么问题？》《你怎么那么多问题？》《给你脸了》'},
        {id: 268, barage: '弹幕小心点，主播一直在瞟弹幕，在找软柿子，别怪哥们没提醒'},
        {id: 269, barage: '平日不修善果，直播折磨大伙，赢了沾沾自得，输了不能怪我，水友提刀焯水来 今日方知猪是我'},
        {id: 270, barage: '叶先生您好，您购买的真人比例馒头90kg【私密发货】【新型硅胶】已经到达驿站，请及时取'},
        {id: 271, barage: 'nuke这张图好啊，他让我想起了一位传奇主播在这奋战到加时最后惜败的往事'},
        {id: 272, barage: '《15：0怕什么 送两分》《不是还有10个赛点 别急》《老白这连狙 哎哟》《完蛋 曹》'},
        {id: 273, barage: '刘頔越大，刘頔越小，刘越大，所以頔越小，頔越小，所以刘越大，所以刘頔越大，刘頔越小'},
        {id: 274, barage: '"冬瓜强不要！那里太烫了！"不顾阿胖的惊恐哭泣，冬瓜强狞笑着把头伸进了烤箱变成了猪头"'},
        {id: 275, barage: '你说的这些我都不懂 我就知道有个叫白坤华的自从那场nuke后 连人带连狙消失了'},
        {id: 276, barage: '鱼越大，鱼刺越大，鱼刺越大，肉越少，肉越少，鱼越小，所以鱼越大，鱼越小'},
        {id: 277, barage: '看了一下这个直播间一半的人都在骂主播，我很失望 另一半人是没键盘还是没手啊'},
        {id: 278, barage: '不是，哥们我工作了一天晚上想放松一下结果你把+1给关…欸没关啊？卧槽爽！'},
        {id: 279, barage: '《指出我的刘頔》《我有什么刘頔》《这也算是刘頔？》《你哪来那么多刘頔？》《给你頔了》'},
        {id: 280, barage: '+1其实是有历史传承的，孔子的弟子就是不断把孔子说的话+1，就有了论语'},
        {id: 281, barage: '弹幕+1复制怪能不能消停啊，如果影响到我学技术，我就举报直播间，到时候都别学了'},
        {id: 282, barage: '一帮不上班的人天天守着直播间，看到好的弹幕就收藏，发出来有人加一就咧着个B嘴在那笑'},
        {id: 283, barage: '冬瓜确实挺帅的，起码在cs主播里面算帅哥了（一块钱一条）'},
        {id: 284, barage: '大狗强其实真的挺帅的 我一直都是喜欢他的颜值 因为我看不懂游戏（ps：我是女粉）'},
        {id: 285, barage: '《是的，刘頔！》《对的，披頔！》《牛的，强頔！》 《卧槽里的，diyy！》'},
        {id: 286, barage: '有些老哥还是放不开啊，别闷声不响搞得好像多有素质一样，看见啥比不骂就是危害社会'},
        {id: 287, barage: '哥们你这直播是真好做，自己一副鳖孙脸往那一坐，等着弹幕自己刷烂梗就完事了'},
        {id: 288, barage: '不会真有那种从收藏夹里复制烂梗，然后眼巴巴的等着别人+1，加完自己嘿嘿笑的吧'},
        {id: 289, barage: '一直刘頔烦不烦，一遍两遍刘頔差不多就得了，同意的刘頔'},
        {id: 290, barage: '鱼越大，鱼刺越大，鱼刺越大，肉越少，肉越少，鱼越小，所以鱼越大，鱼越小'},
        
        

  
      ],  
      randomlySelectedItem: null
    };
  },
  methods: {
    getRandomItem() {
      if (this.items.length > 0) {
        const randomIndex = Math.floor(Math.random() * this.items.length);
        this.randomlySelectedItem = this.items[randomIndex];
      }
    }
  },
  created() {
    this.getRandomItem();
  },
  computed: {
    filteredItems() {
      return this.searchQuery ? this.items.filter(item =>
          item.barage.toLowerCase().includes(this.searchQuery.toLowerCase())
      ) : [];
    }
  }

};


</script>

<script setup>

const open2 = () => {
  ElMessage({
    message: '复制成功',
    type: 'success',
  })
};

const open4 = () => {
  ElMessage.error('复制失败，请检查浏览器是否禁用navigator.clipboard对象或手动复制,请勿使用夸克浏览器')
};

const copyText = (text) => {
  navigator.clipboard.writeText(text)
      .then(() => {
        // 复制成功，可以显示提示信息  
        open2();
        console.log('内容已复制到剪贴板');
      })
      .catch((err) => {
        // 复制失败，可以显示错误信息  
        console.error('复制失败:', err);
        open4()
      });
};


</script>

<style>

</style>