<template>
  <div>
    <div class="card" style="margin-bottom: 5px ">
      <el-table stripe :data="currentPageData" style="font-size: 18px;">
        <el-table-column type="index" width="60" label="序号" align="center"></el-table-column>
        <el-table-column prop="barrage" label="弹幕"></el-table-column>
        <el-table-column label="" align="center" width="85">
          <template #default="scope">
            <el-button type="primary" @click="copyText(scope.row.barrage)">复制</el-button>
          </template>
        </el-table-column>
      </el-table>
    </div>
    <div class="pagination-wrapper">
      <!-- 分页 -->

      <div>
        <el-pagination
            background
            layout="prev, pager, next, jumper"
            :total="tableData.length"
            :page-size="pageSize"
            @current-change="handlePageChange"
        ></el-pagination>
      </div>
      <div class="pagination-text">--------最新弹幕在后面的页号中---------</div>
    </div>
  </div>
</template>

<script setup>
import {ref, computed} from 'vue';
import request from "@/utils/request";
import {ElMessage} from 'element-plus'

request.get('/').then(res => {
  console.log(res)
})
//原始数据
const tableData = ref([

  {barrage: '+1可以，但是请你们+1的时候标注+1的是谁的弹幕，请尊重弹幕著作'},
  {barrage: 'α这是阿尔法，β这是贝塔，γ这是伽玛，δ这是德尔塔，ε这是我亲瓜瓜的小嘴巴'},
  {barrage: '🤖机器人测试弹幕，请机器人🤖自行+1，+1的都是机器人🤖'},
  {barrage: '此弹幕用于统计原神玩家，请原神玩家看到此弹幕后+1'},
  {barrage: '加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！'},
  {barrage: '老子真想把设计这个加一过快，请稍后再试的b一刀杀了！'},
  {barrage: '您的账号在另一地点登录，弹幕连接已断开 点击重新连接弹幕'},
  {barrage: '天天这几句尬逼语录复制粘贴，脑壳里装的是脑浆我觉得就做不出来这种事，尬逼一群'},
  {barrage: '我在“不骂冬瓜强”活动中坚持了60秒，获得称号《是没键盘还是没手》，你也来试试吧。'},
  {barrage: '我在“世界养猪大赛”中养出了猪王“椰汁糕冬瓜强”，点击+1'},
  {barrage: '卧槽哥们你装啥b装的太像了，把大伙都骗了，弹幕都在喷你是啥b，我tm以为你真是啥'},
  {barrage: '系统提示：您在不骂冬瓜强的活动中坚持了一分钟，获得称号“没键盘还是没手。”'},
  {barrage: '有人复制一下我的弹幕吗，我也想躲在被子里偷笑'},
  {barrage: '原创弹幕也是有知识产权的 我辛苦想出的弹幕 你+1就变成你的了 小心我告你侵权'},
  {barrage: '这弹幕不是俺偷嘞，是俺看别人发出来俺复制嘞，俺以为没人要嘞'},
  {barrage: '＋1这个b功能真应该关了，辛苦想出来的弹幕点一下就变成别人的了，一点版权意识都没'},
  {barrage: '你还在为打字慢而发愁吗，还在为跟不上弹幕节奏而难过吗，点击“➕1”摆脱困境，享受快乐。'},
  {barrage: '好久没看了，请问现在还有复制弹幕带ID的绝绝子吗'},
  {barrage: '白字来上厕所连厕纸都不买😅（别复制爷弹幕自己会发）'},
  {barrage: '爽！😎这才叫音乐！😋👍爽！😎这才叫音乐！😋👍爽！😎这才叫音乐！😋👍'},
  {barrage: '让✋我✋们✋停✋止✋这✋场✋闹✋剧✋吧'},
  {barrage: '勒布朗来了🦍🏀🦍🏀🦍🏀🦍🏀🦍🏀🦍🏀🦍🏀'},
  {barrage: '不是，哥们，我说你也太势利了，老子不送礼物你就不谢的。你就不能随便编一个谢一下?'},
  {barrage: '不要一杀人就撇头看弹幕，跟我家的狗捡到棍子屁颠屁颠跑过来看着我一样'},
  {barrage: '实话实说，对他人的原创弹幕进行+1属于严重的剽窃行为，建议取消+1，同意的＋1'},
  {barrage: '红色是危险，蓝色是冷漠，绿色是伪装，紫色是神秘，橙色是愤怒，黑色是归宿，黄色发给我'},
  {barrage: '《免责声明》：本人在观看过程中没有发表指挥主播游戏操作的弹幕 主播破防后 请别误伤'},
  {barrage: '梅西好歹还在场边能看到，你直播间都看不到你人，你比梅西还牛逼'},
  {barrage: '《指出我的问题》《这是我的问题？》《我有什么问题？》《你怎么那么多问题？》《给你脸了》'},
  {barrage: '弹幕小心点，主播一直在瞟弹幕，在找软柿子，别怪哥们没提醒'},
  {barrage: 'nuke这张图好啊，他让我想起了一位传奇主播在这奋战到加时最后惜败的往事'},
  {barrage: '《15：0怕什么 送两分》《不是还有10个赛点 别急》《老白这连狙 哎哟》《完蛋 曹》'},
  {barrage: '鱼越大，鱼刺越大，鱼刺越大，肉越少，肉越少，鱼越小，所以鱼越大，鱼越小'},
  {barrage: '看了一下这个直播间一半的人都在骂主播，我很失望 另一半人是没键盘还是没手啊'},
  {barrage: '不是，哥们我工作了一天晚上想放松一下结果你把+1给关…欸没关啊？卧槽爽！'},
  {barrage: '《指出我的刘頔》《我有什么刘頔》《这也算是刘頔？》《你哪来那么多刘頔？》《给你頔了》'},
  {barrage: '+1其实是有历史传承的，孔子的弟子就是不断把孔子说的话+1，就有了论语'},
  {barrage: '弹幕+1复制怪能不能消停啊，如果影响到我学技术，我就举报直播间，到时候都别学了'},
  {barrage: '一帮不上班的人天天守着直播间，看到好的弹幕就收藏，发出来有人加一就咧着个B嘴在那笑'},
  {barrage: '冬瓜确实挺帅的，起码在cs主播里面算帅哥了（一块钱一条）'},
  {barrage: '大狗强其实真的挺帅的 我一直都是喜欢他的颜值 因为我看不懂游戏（ps：我是女粉）'},
  {barrage: '《是的，刘頔！》《对的，披頔！》《牛的，强頔！》 《卧槽里的，diyy！》'},
  {barrage: '有些老哥还是放不开啊，别闷声不响搞得好像多有素质一样，看见啥比不骂就是危害社会'},
  {barrage: '哥们你这直播是真好做，自己一副鳖孙脸往那一坐，等着弹幕自己刷烂梗就完事了'},
  {barrage: '不会真有那种从收藏夹里复制烂梗，然后眼巴巴的等着别人+1，加完自己嘿嘿笑的吧'},
  {barrage: '一直刘頔烦不烦，一遍两遍刘頔差不多就得了，同意的刘頔'},
  {barrage: '《我看刘頔三年了》《我真不知道这不能刘頔》《不能上刘頔我要憋死了》《求求了批高给我刘頔吧》'},
  {barrage: '把爱留在csgo～把钱留在buff倒勾～把屎留在63136～'},
  {barrage: '主播，我四年前给你办了张卡，现在我想退卡，按年利率3%，复利四年，你应该退我六块七毛五分'},
  {barrage: '小小DG洗完澡🛀，突然想要导一导👋🏽，低头往下找小鸟🐦，只见肚子不见鸟'},
  {barrage: '现在觉得主播直播就是一种艺术，其文艺气息甚至可以媲美达芬奇，可惜差了一个奇字.'},
  {barrage: '《我要戒頔了》《直接頔了》《頔两天》《忘了 頔两口》《頔頔味道》《不管了頔了得了》'},
  {barrage: 'nuke这张图好啊，他让我想起了一位传奇主播在这先手15分被打到加时最后惜败的往事'},
  {barrage: '你TM再叫一句？老子一拳捣死你'},
  {barrage: '这要是馒头报的点我都不敢想象冬瓜会说什么污言秽语'},
  {barrage: '一只睾，听说最近阿giao在做活动，硕士可以补个蛋，哦你是中专啊，那小心他把你另一个蛋也噶了'},

]);

// 每页显示的数据量
const pageSize = ref(15);
// 当前页码
const currentPage = ref(1);
// 计算当前页应该显示的数据
const currentPageData = computed(() => {
  const start = (currentPage.value - 1) * pageSize.value;
  const end = start + pageSize.value;
  return tableData.value.slice(start, end);
});

// 处理页码改变的事件
const handlePageChange = (newPage) => {
  currentPage.value = newPage;
};


const open2 = () => {
  ElMessage({
    message: '复制成功',
    type: 'success',
  })
};

const open4 = () => {
  ElMessage.error('复制失败，请检查浏览器是否禁用navigator.clipboard对象或手动复制,请勿使用夸克浏览器')
};

const copyText = (text) => {
  navigator.clipboard.writeText(text)
      .then(() => {
        // 复制成功，可以显示提示信息  
        open2();
        console.log('内容已复制到剪贴板');
      })
      .catch((err) => {
        // 复制失败，可以显示错误信息  
        console.error('复制失败:', err);
        open4()
      });
};


</script>

<script>
//百度统计
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "https://hm.baidu.com/hm.js?b9634ebcad194c62131c24600b2e1b10";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();

</script>

<style scoped>
.pagination-wrapper {
  display: flex;
  align-items: center;
}

.pagination-text {
  margin-left: 50px;
  color: red;
}
</style>