<template>
  <div>
    <div class="card" style="margin-bottom: 5px ">
      <el-table stripe :data="currentPageData" style="font-size: 18px;">
        <el-table-column type="index" width="60" label="序号" align="center"></el-table-column>
        <el-table-column prop="barrage" label="弹幕"></el-table-column>
        <el-table-column label="" align="center" width="85">
          <template #default="scope">
            <el-button type="primary" @click="copyText(scope.row.barrage)">复制</el-button>
          </template>
        </el-table-column>
      </el-table>
    </div>
    <div class="pagination-wrapper">
      <!-- 分页 -->

      <div>
        <el-pagination
            background
            layout="prev, pager, next, jumper"
            :total="tableData.length"
            :page-size="pageSize"
            @current-change="handlePageChange"
        ></el-pagination>
      </div>
      <div class="pagination-text">--------最新弹幕在后面的页号中---------</div>
    </div>
  </div>
</template>

<script setup>
import {ref, computed} from 'vue';
import request from "@/utils/request";
import {ElMessage} from 'element-plus'

request.get('/').then(res => {
  console.log(res)
})
//原始数据
const tableData = ref([

  {barrage: '“猪手一双，蹄子两双，胡言乱语，脑子煲汤，全身上下，猪头最香，赢了纯躺，输了还装'},
  {barrage: '《藏头诗》冬瓜强一坨史，瓜强一坨史，强一坨史，一坨史，坨史，史'},
  {barrage: '《后室更新了》《明天就后室》《等刘迪结束就后室》《再刷后室杀了》'},
  {barrage: '《明天后室》是由冬瓜强指导，为游戏《后室》设计的DLC，将于明天上线。'},
  {barrage: '《是的，直升机》《对的，肘击》《牛的，牢大》《卧槽里的，黄色冰红茶》'},
  {barrage: '《我要戒烟了》《直接扔了》《戒两天》《忘了 把两口》《闻闻味道》《不管了死了得了》'},
  {barrage: '《邀功声明》主播本次精彩高效行动纯属听取本人指挥。主播只是代为执行。所有荣耀归本人所有。'},
  {barrage: '《以后俩小时把一根，兄弟们帮我监督》《我说戒烟，就肯定会戒了》《我再抽我就是丧狗》'},
  {barrage: '✋停✋止✋这✋场✋闹✋剧✋吧✋✋停✋止✋这✋场✋闹✋剧✋吧✋'},
  {barrage: '⚡😎享受⚡😎⚡😎享受⚡😎⚡😎享受⚡😎⚡😎享受⚡😎⚡😎享受⚡😎'},
  {barrage: '🍚🥢🐷哼哧哼哧🍚🥢🐷哼哧哼哧🍚🥢🐷哼哧哼哧🍚🥢🐷哼哧哼哧'},
  {barrage: '👊🏿男人 哈哈哈，🎤什么可以我说？🚁曼巴 👉🏿出去！'},
  {barrage: '👍😀天才👍😀天才👍👍😀天才👍😀天才👍👍😀天才👍😀天才👍'},
  {barrage: '💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃💃'},
  {barrage: '🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬🦴嘬'},
  {barrage: '🧡甜💛瓜💚西💙瓜💜哈🧡蜜💜瓜💚不💛爱🧡冬💛瓜❤️是💗傻🤎瓜'},
  {barrage: '蔡徐坤❤陈立农❤范丞丞❤黄明昊❤林彦俊❤朱正廷❤王子异❤王琳凯❤尤长靖❤️冬瓜强'},
  {barrage: '抽的越多,肺癌越早.肺癌越早,活的越少.活的越少,抽的越少.所以抽的越多抽的越少'},
  {barrage: '冬瓜别气，喝奶奶🍼🍼🍼🍼🍼冬瓜别气，喝奶奶🍼🍼🍼🍼🍼'},
  {barrage: '刚来，谁窥？谁针对？谁在 捂眼喊撤退？谁混？谁内鬼？谁的玩法不团队？谁又没有人情味？'},
  {barrage: '给点吧😭🤲给点吧😭🤲给点吧😭🤲给点吧😭🤲给点吧😭🤲'},
  {barrage: '瓜强你声音小点我男朋友睡着了把他喊醒了他又要弄我'},
  {barrage: '怪不得你有自信开摄像头 你这样的猪🐷到双汇和金锣哪不是顶级食材啊'},
  {barrage: '好🥬，看得好爽😋！好🥬，看得好爽🥳！好🥬，看得好爽😋！好🥬，看得好爽🥳'},
  {barrage: '呼，瓜酱の笑颜、就算是我这样「卑·微」の肥宅，也想要一直守护！欺负瓜酱的事情、是绝对——达咩哟！'},
  {barrage: '急死了都🥵急死了都🥵急死了都🥵急死了都🥵急死了都🥵急死了都🥵急死了都🥵'},
  {barrage: '家人们，家人们，9敏🆘🆘，我真的会谢❗❗❗大无语事件发生，咱就是说最近在小红薯发现'},
  {barrage: '叫兄弟太亲密，叫主播太生疏，叫homie太崇洋，叫宝贝太油腻，晚上好儿子'},
  {barrage: '今天登了女儿斗鱼🌹看看女儿平时刷些什么🌹是你我就放心了🌹男人就该像你这样🌹'},
  {barrage: '老哥们，我多嘴问一句，我可以多嘴问一句吗，如果可以，那我多嘴问一句，我多嘴吗？'},
  {barrage: '米娜玩个大富翁混一混都有四千贵宾，隔壁冬瓜强奶都要摇掉了才五千贵宾'},
  {barrage: '明天我中忍考试了，你可以跟我签订通灵契约做我的忍犬吗'},
  {barrage: '@JaLEn半仙：瓜强，我这里有锁匠任务'},
  {barrage: '那你无敌了呀?那你这运气谁能跟你比啊?那你太强了啊?那谁玩得过你啊'},
  {barrage: '那你无敌了呀🤡那你这运气谁能跟你比啊🤡那你太强了啊🤡那谁玩得过你啊'},
  {barrage: '你到底在自卑什么，像你这种品种的狗，在哪个宠物市场不是被抢购一空？'},
  {barrage: '你们男生是不是都好色啊？我在学校都不敢看你们，怕你们在心里把我那个了'},
  {barrage: '你们这帮傻波一弹幕电死你们⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟⚡️嘟'},
  {barrage: '你要怪我偷你外卖，那我还要问你为什么要点外卖呢，点了外卖还想吃外卖？好事怎么都让你占了'},
  {barrage: '尿越多，肾越差，肾越差，尿越频，尿越频，尿越少，所以，尿越多，尿越少'},
  {barrage: '穷玩车富玩表，没钱我就玩玩鸟，对着瓜瓜岛一岛，舒服一秒是一秒'},
  {barrage: '人越多，+1越多，+1越多，人越烦，人越烦，人越少，所以，人越多，人越少'},
  {barrage: '上一天班烦死了！😡还好有你叶志高我****！'},
  {barrage: '實況主可以喘小聲些嗎,林北的咕咕bird都快爆掉了,沒在誇張的'},
  {barrage: '虽然主播的外观、智力水平、生活习性等与猪高度类似，但仍不能排除主播是人类的可能性'},
  {barrage: '塔斯汀余姚万达店：你要点就现在点，别tm天天老子要下班了你来个单'},
  {barrage: '头戴三清🙏脚踏万兵🤲正调北斗🤘左调七星🤙金光速现👌覆护真人👇急急如律令 输'},
  {barrage: '外卖员发现主播点小份塔斯汀当晚饭，心疼偷偷地升级成大份并留言：吃大份去吧'},
  {barrage: '洧妏采沵僦隂陽怪氣，莈妏采沵僦復淛秥萜，莂讓沵哪個b掱娴着，適個矗譒簡芣養娴亾'},
  {barrage: '温馨提示：检测到你的情绪不稳定，可能是因为您大脑中的尼古丁含量较低，建议你马上整一根'},
  {barrage: '我不知道互联网恶意为什么这么大，几千人对着一个带有明显智力障碍的人恶语相向'},
  {barrage: '我不知道你为什么一定要想办法去说服一个智力有明显缺陷的CS2玩家'},
  {barrage: '我问大师 主播是什么水平？大师指了指旁边炉子上正在烧的水 我问：开了？ 大师：沸物'},
  {barrage: '我问菩萨为什么那么多人骂主播，菩萨问我骂了没，我说没有我是房管，菩萨说卧槽帮我解一下'},
  {barrage: '我先睡了真不是害怕明天要高考🥵🥵🥵我先睡了真不是害怕明天要高考🥵🥵🥵'},
  {barrage: '我在“清君侧”活动中清除反贼“Big茄子”，帮助主播成为csgo一哥，你也快来试一试'},
  {barrage: '我组了个商队去行商，路上途径沙漠决定用骆驼运货，问骆驼商几只够用，他指了指冬瓜：一驼够使'},
  {barrage: '卧槽我什么时候关注的这主播？那天偶然看到在播apex就点进来了，现在在玩的这是什么无聊游戏'},
  {barrage: '卧槽兄弟你操作太牛了 真想给你刷个飞机 但我是穷哥们 只能打给你了'},
  {barrage: '香烟入嘴，七分化作操作。剩下的三分，啸成了怒火。B嘴一吐，便是半个余姚。《忆瓜强》'},
  {barrage: '一直教有什么意思 主播会记得你是谁？ 老老实实看他小丑得了 这样永远都是你骂他'},
  {barrage: '有没有姐妹也看不懂游戏，但很吃我们瓜瓜颜的，蹲蹲（˵¯͒¯͒˵)'},
  {barrage: '有些弹幕真的是目光短浅，看见主播发挥不好就开始嘲笑，等着吧，更好笑的还在后头呢！'},
  {barrage: '有些彈幕蠻婆媽的，台胞的發言都有在裝吼，再講古怪，林北壹巴掌送妳壹個咚咚锵'},
  {barrage: '有着易峰的忠贞，亦凡的节欲，丁真的智慧，劲夫的温柔，志祥的专一，关注低级Q永远不悔'},
  {barrage: '鱼越大，鱼刺越大，鱼刺越大，鱼肉越少，鱼肉越少，鱼越小，所以鱼越大，鱼越小'},
  {barrage: '怎么还有人教啊，你说错了他嘲讽你，你说对了他觉得自己厉害，不如直接人身攻击他屁都不敢放'},
  {barrage: '这种劣迹斑斑屡教不改的主播，每天就是警告两下就没了，唬弄谁？有意思？对斗鱼失望'},
  {barrage: '这种主播，有一股媚劲，真不是一般的小男生能比的。要说媚在哪儿，那就是媚有脑子'},
  {barrage: '主播是典型的名气大于实力，你要问主播有什么名气，确实没有，但也大于实力'},
  {barrage: '主播我给你引流了，我刚刚点了两下举报说会有人持续关注你'},
  {barrage: '装备最好，杀人最少，年龄最老，对枪就倒，死了低头，手机玩饱，问我是谁，斗鱼瓜宝'},
  {barrage: '做好自己就OK了，不用管他人的闲言碎语，他们骂你，你就当他们骂的是狗'},
  {barrage: '有文采你就刘頔，没文采你就刘頔，别让你那刘頔闲着，这个直播间不养刘頔'},
  {barrage: '主播 骂你的人太多了 我举报不过来 我直接把直播间举报了 端了他们老巢'},
  {barrage: '没办法，这种情况是真的没一点办法。但凡有一点办法也不至于一点办法也没有'},
  {barrage: '不攻击主播的建议买张高铁票到成都东转动车到乐山坐3路到大佛寺站下，叫坐着的那位起来你坐'},
  {barrage: '你现在可以选择不攻击主播，但当主播破防了开始无差别攻击弹幕时，别在这里委屈'},
  {barrage: '这把还有黑点？弹幕属实尬黑了（IP属地：四川省乐山市乐山大佛景区)'},
  {barrage: '嘿嘿☺️…这波有点小帅…偷偷瞄一下弹幕👀（😡怎么都是在骂的）'},
  {barrage: '这个直播间的氛围真的好融洽，简直像是一家三代：儿子在玩，爸爸在教，爷爷在看'},
  {barrage: '一拳捣死你👊😡👊一拳捣死你👊😡👊一拳捣死你👊😡👊一拳捣死你👊😡👊'},
  {barrage: '今日若我冷眼旁观，他日祸临己身，则无人为我摇旗呐喊！放人！'},
  {barrage: '开抽🤡🚬嘶🤡🚬嘶🤡🚬嘶🤡🚬嘶🤡🚬嘶🤡🚬嘶🤡🚬嘶'},
  {barrage: '有文化你就阴阳怪气，没文化你就人身攻击，别搞得像没手没键盘，主播破防时不会放过你的'},
  {barrage: '我在不骂主播活动中坚持了17秒，获得称号《没键盘还是没手？》你也来试试吧'},
  {barrage: '刮墙面对满屏的嘲讽和挖苦。他总是默默看着。从来不回应和解释。因为他明白弹幕说的都是真的'},
  {barrage: 'ququ有流星，小鬼有这谁，你只有sb深海鱼ququ有流星，小鬼有这谁，你只有sb深海鱼'},
  {barrage: '想做瓜瓜的photoshop，这样就能狠狠的设瓜瓜的比例了'},
  {barrage: '想变成瓜瓜的凉鞋，这样瓜瓜酸酸臭臭的小脚践踏我的时候我就能吮吸他酸酸甜甜的脚汗了'},
  {barrage: '誒？   主播开团是吧  粉丝发言上升主播素质吗？  上升的话我就火力全开了'},
  {barrage: '十枪九空，落得八场七负，六胜五躺，却骂四个憨批队友，三番两次破防，我看阁下啥比一'},
  {barrage: '⎛⎝≥⏝⏝≤⎠⎞⎛⎝｡◕‿◕｡⎠⎞ ⎛⎝≥⏝⏝≤⎠⎞⎛⎝｡◕‿◕｡⎠⎞'},
  {barrage: '钱挣了 大房子有了 有漂亮老婆了 不愿意穿旺仔衣服逗哥们了😭'},
  {barrage: '稀碎的枪法，错误的思路，匮乏的想象力，慌乱的抉择，每一帧都是笑柄，看你直播真是一种享受'},
  {barrage: '老子挂直播间睡觉了，你搞耍可以，但是不要突然大吼大叫，惊了老子睡觉就喷你，听到没有'},
  {barrage: '@Minana呀:请问你连续几天在我直播间发“继续摇晃就好”和“练枪时间'},
  {barrage: '瓜强啊，我从大学看你直播到现在工作， 大学那会没钱没刷礼物，现在工作有钱了我'},
  {barrage: '《导一下》《嗯》《卧槽》《牛逼》《完了》《55 54 53 52》《ok》《我超哥呢》'},
  {barrage: '瓜强我陪你一根 嘶~~้้้้๎๎๎๎้้้้๎๎้้้้๎๎๎๎้้้้๎๎๎๎้้้้้้'},
  {barrage: '▷ ︎ı¦¦ııı¦¦ı¦ 2” 转化成文字：FW'},
  {barrage: 'ィ亭✋祉✋這✋cんǎnɡ✋閙✋居リ✋ロ巴✋ィ亭✋祉✋這✋cんǎnɡ✋閙✋居リ✋ロ巴✋'},
  {barrage: '◥▇▇▆▆▅▅◙▬▬▬▬▬▬▬▬▬▬▬▬▬————批瓜看刀'},
  {barrage: '她擦不擦边我知道，现实中没人愿意给我看，她一个陌生人却愿意给我看，这不是擦边，这是在给基层送温暖'},
  {barrage: '你现在可以选择不攻击主播，但当主播破防红温之后，别咧个B嘴笑觉得是自己的功劳'},
  {barrage: '@塔斯汀余姚店：你要点就现在点，别tm天天老子要下班了你来个单'},
  {barrage: '主播您好，我是您花钱买的水军，看了俩小时没找到一个能夸的点，您申请退款吧'},
  {barrage: '+1可以，但是请你们+1的时候标注+1的是谁的弹幕，请尊重弹幕著作'},
  {barrage: 'α这是阿尔法，β这是贝塔，γ这是伽玛，δ这是德尔塔，ε这是我亲瓜瓜的小嘴巴'},
  {barrage: '🤖机器人测试弹幕，请机器人🤖自行+1，+1的都是机器人🤖'},
  {barrage: '此弹幕用于统计原神玩家，请原神玩家看到此弹幕后+1'},
  {barrage: '加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！加一！爽！'},
  {barrage: '老子真想把设计这个加一过快，请稍后再试的b一刀杀了！'},
  {barrage: '您的账号在另一地点登录，弹幕连接已断开 点击重新连接弹幕'},
  {barrage: '天天这几句尬逼语录复制粘贴，脑壳里装的是脑浆我觉得就做不出来这种事，尬逼一群'},
  {barrage: '我在“不骂冬瓜强”活动中坚持了60秒，获得称号《是没键盘还是没手》，你也来试试吧。'},
  {barrage: '我在“世界养猪大赛”中养出了猪王“椰汁糕冬瓜强”，点击+1'},
  {barrage: '卧槽哥们你装啥b装的太像了，把大伙都骗了，弹幕都在喷你是啥b，我tm以为你真是啥'},
  {barrage: '系统提示：您在不骂冬瓜强的活动中坚持了一分钟，获得称号“没键盘还是没手。”'},
  {barrage: '有人复制一下我的弹幕吗，我也想躲在被子里偷笑'},
  {barrage: '原创弹幕也是有知识产权的 我辛苦想出的弹幕 你+1就变成你的了 小心我告你侵权'},
  {barrage: '这弹幕不是俺偷嘞，是俺看别人发出来俺复制嘞，俺以为没人要嘞'},
  {barrage: '＋1这个b功能真应该关了，辛苦想出来的弹幕点一下就变成别人的了，一点版权意识都没'},
  {barrage: '你还在为打字慢而发愁吗，还在为跟不上弹幕节奏而难过吗，点击“➕1”摆脱困境，享受快乐。'},
  {barrage: '好久没看了，请问现在还有复制弹幕带ID的绝绝子吗'},
  {barrage: '白字来上厕所连厕纸都不买😅（别复制爷弹幕自己会发）'},
  {barrage: '爽！😎这才叫音乐！😋👍爽！😎这才叫音乐！😋👍爽！😎这才叫音乐！😋👍'},
  {barrage: '让✋我✋们✋停✋止✋这✋场✋闹✋剧✋吧'},
  {barrage: '勒布朗来了🦍🏀🦍🏀🦍🏀🦍🏀🦍🏀🦍🏀🦍🏀'},
  {barrage: '不是，哥们，我说你也太势利了，老子不送礼物你就不谢的。你就不能随便编一个谢一下?'},
  {barrage: '不要一杀人就撇头看弹幕，跟我家的狗捡到棍子屁颠屁颠跑过来看着我一样'},
  {barrage: '实话实说，对他人的原创弹幕进行+1属于严重的剽窃行为，建议取消+1，同意的＋1'},
  {barrage: '红色是危险，蓝色是冷漠，绿色是伪装，紫色是神秘，橙色是愤怒，黑色是归宿，黄色发给我'},
  {barrage: '《免责声明》：本人在观看过程中没有发表指挥主播游戏操作的弹幕 主播破防后 请别误伤'},
  {barrage: '梅西好歹还在场边能看到，你直播间都看不到你人，你比梅西还牛逼'},
  {barrage: '《指出我的问题》《这是我的问题？》《我有什么问题？》《你怎么那么多问题？》《给你脸了》'},
  {barrage: '弹幕小心点，主播一直在瞟弹幕，在找软柿子，别怪哥们没提醒'},
  {barrage: 'nuke这张图好啊，他让我想起了一位传奇主播在这奋战到加时最后惜败的往事'},
  {barrage: '《15：0怕什么 送两分》《不是还有10个赛点 别急》《老白这连狙 哎哟》《完蛋 曹》'},
  {barrage: '鱼越大，鱼刺越大，鱼刺越大，肉越少，肉越少，鱼越小，所以鱼越大，鱼越小'},
  {barrage: '看了一下这个直播间一半的人都在骂主播，我很失望 另一半人是没键盘还是没手啊'},
  {barrage: '不是，哥们我工作了一天晚上想放松一下结果你把+1给关…欸没关啊？卧槽爽！'},
  {barrage: '《指出我的刘頔》《我有什么刘頔》《这也算是刘頔？》《你哪来那么多刘頔？》《给你頔了》'},
  {barrage: '+1其实是有历史传承的，孔子的弟子就是不断把孔子说的话+1，就有了论语'},
  {barrage: '弹幕+1复制怪能不能消停啊，如果影响到我学技术，我就举报直播间，到时候都别学了'},
  {barrage: '一帮不上班的人天天守着直播间，看到好的弹幕就收藏，发出来有人加一就咧着个B嘴在那笑'},
  {barrage: '冬瓜确实挺帅的，起码在cs主播里面算帅哥了（一块钱一条）'},
  {barrage: '大狗强其实真的挺帅的 我一直都是喜欢他的颜值 因为我看不懂游戏（ps：我是女粉）'},
  {barrage: '《是的，刘頔！》《对的，披頔！》《牛的，强頔！》 《卧槽里的，diyy！》'},
  {barrage: '有些老哥还是放不开啊，别闷声不响搞得好像多有素质一样，看见啥比不骂就是危害社会'},
  {barrage: '哥们你这直播是真好做，自己一副鳖孙脸往那一坐，等着弹幕自己刷烂梗就完事了'},
  {barrage: '不会真有那种从收藏夹里复制烂梗，然后眼巴巴的等着别人+1，加完自己嘿嘿笑的吧'},
  {barrage: '一直刘頔烦不烦，一遍两遍刘頔差不多就得了，同意的刘頔'},
  {barrage: '《我看刘頔三年了》《我真不知道这不能刘頔》《不能上刘頔我要憋死了》《求求了批高给我刘頔吧》'},
  {barrage: '把爱留在csgo～把钱留在buff倒勾～把屎留在63136～'},
  {barrage: '主播，我四年前给你办了张卡，现在我想退卡，按年利率3%，复利四年，你应该退我六块七毛五分'},
  {barrage: '小小DG洗完澡🛀，突然想要导一导👋🏽，低头往下找小鸟🐦，只见肚子不见鸟'},
  {barrage: '现在觉得主播直播就是一种艺术，其文艺气息甚至可以媲美达芬奇，可惜差了一个奇字.'},
  {barrage: '《我要戒頔了》《直接頔了》《頔两天》《忘了 頔两口》《頔頔味道》《不管了頔了得了》'},
  {barrage: 'nuke这张图好啊，他让我想起了一位传奇主播在这先手15分被打到加时最后惜败的往事'},
  {barrage: '你TM再叫一句？老子一拳捣死你'},
  {barrage: '这要是馒头报的点我都不敢想象冬瓜会说什么污言秽语'},
  {barrage: '一只睾，听说最近阿giao在做活动，硕士可以补个蛋，哦你是中专啊，那小心他把你另一个蛋也噶了'},
  {barrage: '大明星了，rmr 打出去了，贴纸出了，群消息不看了，要钻粉才能加好友了'},
  {barrage: '不是哥们你也太势力了，富哥们吐的痰你都要尝尝咸淡。我们编的弹幕理都不理'},
  {barrage: '进攻在断后、防守在渗透、一直在挨揍、斗鱼你最6'},
  {barrage: '主要我也不知道为什么，晚上躺床上，你下播之后，脑海里都是你的声音，就情不自禁的乱摸了'},
  {barrage: '大C63买了，漂亮超哥娶了，大钙奶住上了，刘頔开上了，嫌苏迪们烦了'},
  {barrage: '刚来，谁享受 谁乱秀，谁是鸡仔谁丑陋？谁焦灼，谁难受，谁当小丑还喊救？'},
  {barrage: '挂墙，生日快乐 挂墙，生日快乐 挂墙，生日快乐 挂墙，生日快乐'},
  {barrage: '茄子摆烂了 苏弟跟蛋了 钙奶不播了 那个人切割了 你sldl'},
  {barrage: '主播的技术怎么越来越菜了，哪里菜了。这么多年都是这个水平，不要睁着眼乱说，主播很难的。'},
  {barrage: '我也在+1啊，谁没在+1，+1就应该+1，而不是不 +1 ！'},
  {barrage: '《ephorse大杀四方》《faceit亚洲第一》《斗鱼ju神》《泪撒印尼》《15:0》《0.17》'},
  {barrage: '三年我们TM等了三年啦JEE！三年！卧槽！呜呜呜呜呜呜呜！！！'},
  {barrage: '你拿那么多子弹有什么用打的伤害还没你的子弹多呢'},
  {barrage: '这个直播间氛围太好了，就像在恬静的乡下和邻里一起聊家长里短，偶尔还能听到后院的猪叫'},
  {barrage: 'YZG就是野比大雄 戴眼镜+胆小+一事无成+数学差+考试爱考零分+有个静香+被个肥猪压一头'},
  {barrage: '穷哥们送不起你礼物，只能绞尽脑汁发些弹幕来帮你凑热度，你不谢就算了，读都不读，真下头。'},
  {barrage: '冬瓜越大，瓜棒越短，瓜棒越短，营养越少，营养越少，冬瓜越小，所以冬瓜越大，瓜棒越小'},
  {barrage: '考验眼力！ 从侏罗纪公园里找出冬瓜强！'},
  {barrage: '机械仿生人袁瑞斌 代号M3 根据你本次战役的“优良表现”请自觉前往报废站执行报废程序'},
  {barrage: '士兵2640出列！'},
  {barrage: '仿生机器人袁瑞斌 代号M3 几点开始执行刺杀任务？'},
]);

// 每页显示的数据量
const pageSize = ref(50);
// 当前页码
const currentPage = ref(1);
// 计算当前页应该显示的数据
const currentPageData = computed(() => {
  const start = (currentPage.value - 1) * pageSize.value;
  const end = start + pageSize.value;
  return tableData.value.slice(start, end);
});

// 处理页码改变的事件
const handlePageChange = (newPage) => {
  currentPage.value = newPage;
};


const open2 = () => {
  ElMessage({
    message: '复制成功',
    type: 'success',
  })
};

const open4 = () => {
  ElMessage.error('复制失败，请检查浏览器是否禁用navigator.clipboard对象或手动复制,请勿使用夸克浏览器')
};

const copyText = (text) => {
  navigator.clipboard.writeText(text)
      .then(() => {
        // 复制成功，可以显示提示信息  
        open2();
        console.log('内容已复制到剪贴板');
      })
      .catch((err) => {
        // 复制失败，可以显示错误信息  
        console.error('复制失败:', err);
        open4()
      });
};


</script>

<script>
//百度统计
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "https://hm.baidu.com/hm.js?b9634ebcad194c62131c24600b2e1b10";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();

</script>

<style scoped>
.pagination-wrapper {
  display: flex;
  align-items: center;
}

.pagination-text {
  margin-left: 50px;
  color: red;
}
</style>